{
  "website_summaries": [
    {
      "verdict": "A newer vegan cookbook with a host of unique and delicious plant-based takes on traditional comfort foods.",
      "pros": [
        "Includes 100 easy-to-make recipes",
        "Cookbook is divided into clever sections",
        "Suitable for non-vegans who are curious about vegan cooking",
        "There's also a vast BOSH!",
        "online presence to wade through that includes additional tips and recipes"
      ],
      "cons": [
        "Not necessarily a “healthy” cookbook",
        "Many of the recipes are rich and heavy"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Nothing I’ve ever made from them has ever disappointed, and these recipes look delectable",
      "text": "Move over Thug Kitchen! There’s a new vegan cookbook in town. I received my Bosh cookbook today and have been a fan of their cooking. Nothing I’ve ever made from them has ever disappointed, and these recipes look delectable. I’ve ordered some cookbooks in the past from sites I love and haven’t been inspired, but this cookbook makes me want to make like 90 percent of the recipes. It has a section for quick eats, big eats, showpieces, greens and Bosh! Bowls, small plates and sharers, cocktails, desserts, and breakfasts. I feel like the information will help me make delicious recipes and will also help improve my cooking game. I’d say buy this book!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Page",
      "helpful_votes": 79,
      "publication_date": 20180501
    },
    {
      "title": "Beautiful book, bound too tightly.",
      "text": "This is a beautiful book full of color illustrations and very exciting recipes. My only complaint is that it is too tightly bound in hard covers. It would be better to have a recipe book that will lay open while I am doing the cooking.",
      "rating": 4.0,
      "verified": true,
      "author": "C. O'driscoll",
      "helpful_votes": 72,
      "publication_date": 20180501
    },
    {
      "title": "and it is nicely done. The only complaint I have is during ...",
      "text": "I was really excited about getting this book, and it is nicely done. The only complaint I have is during all the hype there were recipes online for dishes that I was really eager to try because they looked so delicious, and they were not included in the book.",
      "rating": 4.0,
      "verified": true,
      "author": "Rocky Harris",
      "helpful_votes": 57,
      "publication_date": 20180504
    },
    {
      "title": "Very Good! But...",
      "text": "The recipes includded in this book are very good, however, it seems that the short video recipes shown in their Facebok page are even better and more creative. I was looking forward to having those FB recipes in print. Oh, well.",
      "rating": 4.0,
      "verified": true,
      "author": "Roma Ryan",
      "helpful_votes": 45,
      "publication_date": 20180512
    },
    {
      "title": "Buy this cook book",
      "text": "As an owner of many cook books, this is very quickly becoming my favorite of the bunch! All the recipes I have cooked have been perfect and my non-vegan friends love them as much as my vegan family. I would HIGHLY recommend adding this to your kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "bookworm",
      "helpful_votes": 22,
      "publication_date": 20180510
    },
    {
      "title": "Five Stars",
      "text": "Being a vegan is so much fun after all. Thanks for the great recipes!",
      "rating": 5.0,
      "verified": true,
      "author": "Liia London",
      "helpful_votes": 18,
      "publication_date": 20180503
    },
    {
      "title": "Lots of oil, not all the best of Bosh",
      "text": "Long awaited this one but it didnt have the thanksgiving potatoes we loved. Almost all of their recipes stay and end with tons of oil. Leaves me feeling heavy and bloated. The recipes are fairly simple to follow with good picturesof mostof the recipes which is nice.",
      "rating": 3.0,
      "verified": true,
      "author": "Kristen Boyd",
      "helpful_votes": 12,
      "publication_date": 20180712
    },
    {
      "title": "Stunningly beautiful book!",
      "text": "Probably the most beautiful cookbook I own! The quality of the paper and clarity of the photos are excellent. Everything looks so amazing. There are photos of almost every recipe. I can't wait for my next vegan feast!",
      "rating": 5.0,
      "verified": true,
      "author": "Holly",
      "helpful_votes": 13,
      "publication_date": 20180502
    },
    {
      "title": "I love this cookbook, BUT........",
      "text": "I love all the unique recipes in this book, easy to follow instructions and very tasty vegan food. However, I don't consider myself vegan, I eat a plant based diet. In WFPB way of eating, I use very little oil, if any at all. I have made modifications to all of the dishes I have made from the cookbook because there is way too much use of oil for my specific way of eating. I very much enjoy the recipes once modifiied to fit my diet. Eating plants is a great choice for health, but so much oil is not.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn",
      "helpful_votes": 7,
      "publication_date": 20180829
    },
    {
      "title": "Vegan cooking made easy.",
      "text": "I've made several of these recipes and they've all been wonderful. Now that I've made the leap to veganism, the recipes in this book have a lifesaver. They're easy to follow and the pictures are great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20180627
    },
    {
      "title": "Looks like some printing issues.",
      "text": "There is an entire section of the book that is simply missing. It skips from page 112 to 124.",
      "rating": 2.0,
      "verified": true,
      "author": "Stephanie M. Bosch",
      "helpful_votes": 9,
      "publication_date": 20190513
    },
    {
      "title": "Great for those who plan/shop for meals/recipes!",
      "text": "Recipes are good and pretty simple, but many require ingredients that are pricey or not easy to find (definitely things I don’t keep stocked in my kitchen). If you don’t mind grocery shopping for specific recipe ingredients, (something I probably should do because I’m not great at meal planning), it’s an excellent book. There aren’t as many short/easy/quick recipes as I’d hoped for. Many of the more elaborate recipes seem rather tedious and don’t really appeal to me, personally. That said...I do love BOSH! They are awesome and well worth following on social media (especially YouTube and Instagram). They put out 2-3 recipes a day that typically seem simple. I am also looking forward to their next cookbook.",
      "rating": 4.0,
      "verified": true,
      "author": "The Rolling Rook",
      "helpful_votes": 2,
      "publication_date": 20190202
    },
    {
      "title": "Recipes too fussy for everyday meals",
      "text": "I was just not inspired to try the recipes. I may try one in the future, but not a cookbook that makes me want to head for the kitchen and try one out. I much prefer simpler recipes and may return this cookbook (rare for me to return any book).",
      "rating": 3.0,
      "verified": true,
      "author": "MemphisRose",
      "helpful_votes": 5,
      "publication_date": 20180825
    },
    {
      "title": "Love this book!",
      "text": "I'm a fan of the Bosh gentlemen, so of course I had to grab this book! I love it. Although I can't hear the catchy music present in most of their videos, or watch them traipsing all over to taste yummy vegan treats, I can still feel the vibe thru the colorful pics!. I had to give this a bit of time, so I could taste the recipes, and they have been yummy and easy to personalize. We are an omnivore family that eats a high veggie content and I found the recipes to be easily enjoyed by meat eaters as well. I would definitely recommend this as a fun addition to your cookbook collection!",
      "rating": 5.0,
      "verified": true,
      "author": "PurpleFia",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Bad ink good recipes",
      "text": "Nice book, but the trint quality, specifically the ink is terrible. The oils in your skin will smear if you touch and hold. I'm considering returning because of it.",
      "rating": 2.0,
      "verified": true,
      "author": "Mac Daddy",
      "helpful_votes": 4,
      "publication_date": 20190421
    },
    {
      "title": "Better like mushrooms!",
      "text": "A significant percent of the recipes contain mushroom. If you exclude the deserts, it's roughly a quarter.",
      "rating": 3.0,
      "verified": true,
      "author": "krc",
      "helpful_votes": 4,
      "publication_date": 20190204
    },
    {
      "title": "Vegans: Highly Recommend This Cookbook",
      "text": "We went vegan a little over 2 years ago. Hard to find food that really tastes great. Working on it. This cookbook does a great job of providing excellent recipes. We have tried three recipes so far and have another dozen on the \"try\" list. We try one new recipe a week. The ones we have tried have turned out great. Looking forward to \"eating\" our way through the book again and again.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Hect",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Too much gluten!",
      "text": "The recipes in this book look amazing, and I'm sure they are but they use so much gluten in a lot of their recipes. Some things (like pasta) are easy to swap out but for the most part this is useless to me.",
      "rating": 3.0,
      "verified": true,
      "author": "Jos88",
      "helpful_votes": 2,
      "publication_date": 20190801
    },
    {
      "title": "Came Damaged and Has Poor Ink",
      "text": "two stars because i love these guys and have made a couple recipes from their instagram, they are wonderful! otherwise, the quality of this book was disappointing as you can see in pictures. the black ink smudges with the touch of a hand. it feels icky. i flipped through the book too and much of what i was interested in making was not in the book. :/ i'm hoping the newer book has some of the recipes i love.",
      "rating": 2.0,
      "verified": true,
      "author": "Kylie Cox",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Must have",
      "text": "Wanted to support the guys at BOSH by buying this book. They provide a lot of free high value content about vegan recipes and restaurants in their videos. I tried several recipes from this book and so far was delighted by each! Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "SetsandReps",
      "helpful_votes": 2,
      "publication_date": 20181112
    },
    {
      "title": "Way too complicated!",
      "text": "Don't buy this if you are looking for easy recipes! Maybe my definition of easy is different than theirs! Their 30 min or less recipes have way too many ingredients and there is no way I could make them in less than 30min. The food does sound delicious, but make sure you are a very experienced cook who has a lot of time before you buy this!",
      "rating": 1.0,
      "verified": true,
      "author": "Gwen Cooper",
      "helpful_votes": 2,
      "publication_date": 20190721
    },
    {
      "title": "Metric",
      "text": "I love Bosh recipes. I follow them on FB and have made many of their recipes. I was so excited when my husband ordered this cookbook for me. However; after looking through the book I noticed all the recipes had metric measurements. I can do the US measurement conversion easily with the help of the internet but it should have stated somewhere in the description that measurements in the recipes were in metric. Even the pictures for the cookbook show US measurements. Overall I am happy with the cookbook.",
      "rating": 4.0,
      "verified": true,
      "author": "Barbara Zalace",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Where’s the nutritional information?",
      "text": "This deserves five stars. I’ve cooked five different dishes from Bosh! and they were all fantastic. I give it three stars because there is no nutritional information for any of the dishes and these days I think that’s unacceptable. People who would choose a book like this would more than likely want to have an idea of the calories, fat and protean content of the plant based dishes featured here. My wife are just getting into a vegetarian diet, cutting out almost all animal food from our diets so we’re interested in the nutritional info. Otherwise the recipes are wonderful, at least so far.",
      "rating": 3.0,
      "verified": true,
      "author": "Sam Blancato",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Brand new book that I can't even use as it isn't constructed properly",
      "text": "The book contents are great. The book is an absolute mess. There is glue running down the side, sticking all the pages together. Pieces of the inside of the book cover are sticking out. It rips and tears and is not even usable since I can't open it. The publisher didn't notice this? Amazon didn't notice this.",
      "rating": 1.0,
      "verified": true,
      "author": "vegan mom",
      "helpful_votes": 3,
      "publication_date": 20190803
    },
    {
      "title": "This cookbook will make anyone a vegan!",
      "text": "I LOVE this book! It's practical, informative and super easy to use. The dishes are accessible to create and I love that they give you the basic info you need to cook with more plants. I have been able to modify the recipes to exclude oil and they still taste delicious. This will make a great Christmas gift to encourage family and friends to eat more plants and enjoy it tremendously!",
      "rating": 5.0,
      "verified": true,
      "author": "Halii",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "The cookbook you’ve been waiting for!",
      "text": "The cookbook is beautiful! I love the display of the book and it’s well organized. I especially like how the recipes are grouped by cuisine (thai, Mexican, Mediterranean, etc.) I follow Bosh on Instagram and have already made some of these recipes within the book. I was also prepared to have the book in metric units but was thoroughly surprised that it’s in US measurements!! I’ve know some recipes have many ingredients and some that are hard to find but I don’t mind since I am able to explore new foods! I will definitely be buying the other cookbooks! Well done Bosh!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Beautiful Book Awesome Gift to yourself or a Loved One",
      "text": "Beautiful book! I need help with the basics and even the basics there's great insights for and since I didn't know not to put garlic in the refrigerator! Because I've gained so much weight from lack of sleep, trauma I really had to cut down the oil intake so that was the only thing with the recipe book for me as I'm going to cook without the oil or even less and they suggest .",
      "rating": 5.0,
      "verified": true,
      "author": "Suzannah B. Troy",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Long ingredient lists",
      "text": "Great recipes but not for beginners. The recipes are easy to follow but their long list of, sometimes, hard to find ingredients makes this not a great choice for week night meals for the average person.",
      "rating": 5.0,
      "verified": true,
      "author": "Nevada Baker",
      "helpful_votes": 2,
      "publication_date": 20180710
    },
    {
      "title": "Excellent cookbook even for a non-vegetarian",
      "text": "These meals are fantastic. My wife and 18month old agree too. While some recipes take a few ingredients, they are never too complex to make. Of the 15 or so we have tried so far none have disappointed. By adding a bit of chicken in place of tofu or beef strips the meals are great for our family.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Healthy and Vegan",
      "text": "Great quality book. A great price for a hardcover book. The recipes are also really great and there are so many packed into this little book.",
      "rating": 5.0,
      "verified": true,
      "author": "Vivian Willow",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Just. So. Good.",
      "text": "I have a lot of vegan cookbooks and this one is absolutely one of my favorites that gets used time and time again. Every recipe I have tried has been incredibly flavorful and well-explained. There are plenty of options for quick meals along with the more complicated dishes. I've loved them all. I gave this book to my mom (who is not vegan) and she uses it all the time! Do yourself a favor and just get it.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Beautiful plant based recipes at your fingertips",
      "text": "Loving this all whole food plant based recipe book. Some are the recipes are quite involved, but are definitely worth the effort. Love the banana loaf recipe - works superbly every time and is super speedy using a food processor. This is definitely a worthy addition to the kitchen bookcase of anyone persuing a vegan diet, with plenty of tasty and filling dishes beautifully photographed and with clear instructions of how to prepare them. Great value on the Amazon site too, both in Uk and the US.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs B",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "We have tried a few recipes and absolutely LOVE this book-don't know why I waited so long to ...",
      "text": "We have tried a few recipes and absolutely LOVE this book-don't know why I waited so long to order it!",
      "rating": 5.0,
      "verified": true,
      "author": "Corey's Queen 96",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Highly recommend",
      "text": "My daughter has this book and I was impressed with the food she cooked from it. The flavor profiles are nice. I’m not a vegan but trying to eat a little mire healthy.",
      "rating": 5.0,
      "verified": true,
      "author": "sandi",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Love this cookbook",
      "text": "I'm a bit old fashioned in the face that I'd rather have a recipe book that be cooking from recipes on my phone. This cookbook has lots of great easy and some more \"fancy\" recipes. I cook at least 1 or 2 recipes a week from it. We are a family of 2 so we usually have some leftovers which is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Meghan",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Delicious.",
      "text": "I like easy recipes and this book is perfect. It's not only easy to follow but the recipes are so delicious.",
      "rating": 5.0,
      "verified": true,
      "author": "Silviann",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Great Book",
      "text": "Everything in this book is delicious, and I don't understand the negative reviews. Like, you expected something that wasn't even promised. Everything I've made from this book is awesome. Can't wait to try more recipes.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin L Nissimov",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Gift recipient liked book!",
      "text": "Sent this book to my daughter-in-law who is a very talented vegetarian cook! She really liked it! Hooray!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "The recipes are easy to follow",
      "text": "The BOSH! cookbook is the first book I go to when looking for a recipe. The recipes are easy to follow, and I haven't found one I don't like.😁. I highly recommend this book.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary S.",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "levels",
      "text": "The book has definitely opened my eyes. If I was to say something negative, I probably would say that some of the recipes contain sugar some more than others. I would say reduce the sugar where necessary. Apart from that BOSH is a thumbs up.",
      "rating": 4.0,
      "verified": true,
      "author": "MR B MARSHALL",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Love this book!",
      "text": "Love the recipes, love the fact that there’s videos on their IG, love that it’s 100% vegan!",
      "rating": 5.0,
      "verified": true,
      "author": "A.H.",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Beautiful illustrations about Recipes",
      "text": "I have made quite a few recipes from this book and am very satisfied with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Mc Canles",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Should be in every kitchen",
      "text": "This book is amazing. Great recipes that a novice could cook.",
      "rating": 5.0,
      "verified": true,
      "author": "PatriciasBooks",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Amazing dishes!",
      "text": "There are so many dishes in here I don't know where to start making them! They all look and sound amazing I want to make them all! The Bosh guys did not disappoint with this book!",
      "rating": 5.0,
      "verified": true,
      "author": "Kim B.",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Great and easy to follow",
      "text": "I love this book. Bought two—gave one as a gift which ended up turning into someone else wanting one. This is a keeper—great job Bosh!!",
      "rating": 5.0,
      "verified": true,
      "author": "ComeAsYouAre",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Meat eater fearing becoming vegan with so many good recipes",
      "text": "A fried recommended this book and wow this is great. I went ahead and bought their second book! The best fried rice ever is here!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Rosebuds007",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "One hell of a good cook book.",
      "text": "Great book. I'm working my way thru it now. Very very good book with great recipes. Meat eaters will never miss it with these recipes.",
      "rating": 5.0,
      "verified": true,
      "author": "ghs8956",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Great healthy meals!",
      "text": "Even if you aren’t Vegan, Bosh will blow you away. Recipes are easy and delicious!!",
      "rating": 5.0,
      "verified": true,
      "author": "Karr",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Great recipes",
      "text": "Love the book!!! Great recipes. Made the lasagna and it was very good",
      "rating": 5.0,
      "verified": true,
      "author": "natalie hurley",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Great content. Poor binding.",
      "text": "Great recipes and beautifully photographed but the binding on my book came apart on the 2nd day I had it, when I opened it to use a recipe and pages fell out. Very disappointing for a new full price book that I was so anxious to order. I'm hoping it will be replaced and that it won't be a consistent problem....",
      "rating": 4.0,
      "verified": true,
      "author": "Paxsong1",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Beautiful Book",
      "text": "Great book with detailed recipes and beautiful pictures to show how the food will look. Makes eating healthy something to look forward to instead of thinking \"healthy\" equates to dull and boring.",
      "rating": 5.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Yahoooooo!!!!!......",
      "text": "This cookbook is tremendous!! The recipes hit high notes of flavor. Please keep writing cookbooks!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn L. Tate",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "A great variety of recipes of my favorite foods",
      "text": "A great variety of recipes of my favorite foods! I've had it less than a week and have made the naan bread and pho. Both the best I've ever had.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny Siegert",
      "helpful_votes": 2,
      "publication_date": 20180626
    },
    {
      "title": "Great plant based cookbook",
      "text": "I love this book! I’m plant based and constantly searching online for recipes is a pain. All of them can be adapted to gluten free for the most part.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Morse",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "... book was bought for someone else - but they loved it.",
      "text": "The book was bought for someone else - but they loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Gannon",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Not my go to book",
      "text": "I love vegan cookbooks but unfortunately this is one a never used",
      "rating": 3.0,
      "verified": true,
      "author": "T. Whitaker",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Perfect!",
      "text": "I love this book. I've bought 3 already to give as gifts. My favorite part of Sundays is picking a recipe and trying it out. Highly recommend this book.",
      "rating": 5.0,
      "verified": true,
      "author": "Lupi",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Not the worst nor best.",
      "text": "The recipes are mostly pasta based, and the other ingredients are expensive.",
      "rating": 3.0,
      "verified": true,
      "author": "EGM",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Lots of great ideas. I've made two of the dishes so ...",
      "text": "Lots of great ideas. I've made two of the dishes so far and both have been delicious.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily L.",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Great Vegan REcipes!",
      "text": "high quality, visually pleasing cookbook with tasty and ethical recipes. What's not to love?!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenee PS",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "Must have",
      "text": "Great book, printed on great materials. A must have for any vegetarian or vegan.",
      "rating": 5.0,
      "verified": true,
      "author": "Zini Da Kazem",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "I didn’t think I’d like going plant-based.",
      "text": "I’m not a cook, and trying to change my ways because the doctor said so. Easy to follow, and good food.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Sayre",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Buy this!",
      "text": "We LOVE the recipes in here! Very helpful to us as we transition to a vegan lifestyle.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "GREAT cookbook!",
      "text": "This is one of the best vegetarian cookbooks I've seen. Can not WAIT to cook something from it!",
      "rating": 5.0,
      "verified": true,
      "author": "Gaye",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "BOSH! Is the BEST!",
      "text": "BOSH! Is a wonderful recipe book. The recipes are simple and easy to follow but the food they produce is both delicious and ethnically diverse. Even for an infrequent cook like me they produce great results every time. What did I do before BOSH!?",
      "rating": 5.0,
      "verified": true,
      "author": "Julian ",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "One gift he wanted",
      "text": "Good recipes for my son who is a vegan. He has tried some recipes, and said there are pretty good ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlene Margeson",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Great Recipes",
      "text": "Love the book. Easy to follow recipes and great tasting..",
      "rating": 5.0,
      "verified": true,
      "author": "Diana",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Yummy",
      "text": "Such great food in here! If you are thinking of becoming vegan, or just to get some great plant based food, get this book. They also have tons of videos to help you.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Such a good book!!",
      "text": "It has such great recipes that look so delicious cant wait to try some out!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Awesome recipes",
      "text": "Preparing food with this book makes it beautiful, delicious & oh so appealing!! Love, love this book & don’t know how I lived without it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Janet Andrews",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "Amazing cook book",
      "text": "I can not pass a day without this cook book. I tried a lot of recipes and all were delicious. Moreover, these are tasty and super easy to do. I recommend this book for vegan and non vegan people.",
      "rating": 5.0,
      "verified": true,
      "author": "Adeline AZA",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Not for me🤷🏾‍♀️",
      "text": "Didn’t have any recipes from ig that I was interested in making or that was stated in mini videos that would be in cookbook.",
      "rating": 3.0,
      "verified": true,
      "author": "God is Love",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Awesome preview photos",
      "text": "I haven't made any of the recipes yet but I love that there is a small picture of every recipe in the beginning of the book 😊",
      "rating": 5.0,
      "verified": true,
      "author": "Rhya Luckett-Nicholas",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Great intro to vegan cooking",
      "text": "My first plant-based cookbook. Everything in it appeals to me. I’ve made several recipes so far, they’re well-conceived, easy, tasty and good for me. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Dianne",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Good cookbook",
      "text": "Fast shipping, brand new, great recipes. Makes a great gift.",
      "rating": 4.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Five Stars",
      "text": "I've loved everything I've tried from this book so far!!",
      "rating": 5.0,
      "verified": true,
      "author": "Brianna Taniges",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Fantastic!",
      "text": "I love this book. The recipes are so easy yet classy. Pitching this book is one of the best things I have done.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "I ordered more for my friends.",
      "text": "Great cookbook! The photos are great and enticing to make every meal in this book.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Stenersen",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "A must for every kitchen",
      "text": "We love the book, so many inspiring recipes, totally changed the way we cook",
      "rating": 5.0,
      "verified": true,
      "author": "Milan Koppen",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "it doesn't get much better than this",
      "text": "For being vegan, it doesn't get much better than this!",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Beautiful recipes",
      "text": "Loved the book as it helped in exploring a wide variety of vegan recipes",
      "rating": 5.0,
      "verified": true,
      "author": "Amiel Satvedi",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Love it.",
      "text": "Amazing recipe book. Def worth it. Lots of pictures and easy to follow recipes.",
      "rating": 5.0,
      "verified": true,
      "author": "Rena",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "Delicious, easy to follow recipes ! Love it",
      "text": "Really tasty recipes with tons of great info. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Micah",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "A fabulous new cook book!!",
      "text": "Beautiful photos & delicious recipes whether you are vegan or not. So much to try out !!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Purchaser",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Try Veggies!",
      "text": "I like the variety. Did not realize that there really were substitutes for animal meat.",
      "rating": 5.0,
      "verified": true,
      "author": "Romy",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Not many pictures",
      "text": "I am truly disappointed in this book. Many of the recipes lack a picture to illustrate the look of the final dish. I purchased the book in hopes to receive the same online/social media feel. Which isn't what took place.",
      "rating": 2.0,
      "verified": true,
      "author": " Toon",
      "helpful_votes": 4,
      "publication_date": 20180627
    },
    {
      "title": "Lots of mushroom recipes...",
      "text": "I really really really wanted to like this book.... but I just couldn’t. Really mushroom heavy with no options to leave out or replace. I’m so bummed. But these guys are awesome and doing fantastic work... I just really f’ing hate mushrooms.",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer Maciejewski",
      "helpful_votes": 10,
      "publication_date": 20180619
    },
    {
      "title": "Great recipes!",
      "text": "Have loved the online presence of BOSH! For a long time. It’s so nice to have the book version to reference while cooking and to browse for ideas.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolinda",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "everything looks really easy. There are a lot of pictures so you ...",
      "text": "I have not made anything but, everything looks really easy. There are a lot of pictures so you can see what you making which is really nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Disappointed",
      "text": "I love the variety and how it is written. I am however very disappointed that I only found a handful of recipes that they featured online made it into the book. If they put out another recipe book I won't be buying that. One disappointment was enough.",
      "rating": 2.0,
      "verified": true,
      "author": "PNW-Native",
      "helpful_votes": 3,
      "publication_date": 20180603
    },
    {
      "title": "Good product",
      "text": "Color blends into our wood tones well. Feel good knowing sharp corners are protected.",
      "rating": 4.0,
      "verified": true,
      "author": "S.Sparrow",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Stunning photography",
      "text": "Photos are stunning and inspiring but book arrived damaged which doesn’t ode well for it holding up to frequent use.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180503
    },
    {
      "title": "Not only are the pages upside down, but they ...",
      "text": "Not only are the pages upside down, but they are also backwards and partially cut off. Returning this immediately.",
      "rating": 1.0,
      "verified": true,
      "author": "Stacee Duncan",
      "helpful_votes": 53,
      "publication_date": 20180501
    }
  ],
  "product_meta": {
    "title": "BOSH!: Simple Recipes * Amazing Food * All Plants (BOSH Series)",
    "rating": 4.6,
    "specifications": {
      "Item Weight": "2.3 pounds",
      "Hardcover": "288 pages",
      "ISBN-10": "0062820680",
      "ISBN-13": "978-0062820686",
      "Product Dimensions": "7.44 x 0.88 x 9.69 inches",
      "Publisher": "William Morrow Cookbooks; Illustrated Edition (May 1, 2018)",
      "Language:": "English",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Books",
      "Cooking by Ingredient",
      "Cookbooks, Food & Wine"
    ],
    "price": ""
  }
}