{
  "website_summaries": [
    {
      "verdict": "Helpful for beginners who are mainly interested in edible mushrooms.",
      "pros": [
        "Helpful, detailed descriptions of more than 100 edible species",
        "Attractive photographs are useful for identification",
        "Well organized with important information on each mushroom alongside its photograph"
      ],
      "cons": [
        "Some feel the included recipes are distracting",
        "Limited to the most popular edible mushrooms"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great book; great author",
      "text": "I love this book and just completed an incredible weekend workshop with the author. He was so passionate, patient, knowledgeable, and had a great sense of humor. He truly wants everyone to enjoy the wonders of wild mushrooms safely, and he provides all the information needed in an easily readable form. This is the book to have for safe foraging. I am truly caught up in the excitement and have found a local mycology group to go into the woods with, thanks to him. Yay!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Helen S.",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Great book, poor kindle conversion",
      "text": "I’m reading this book now and finding it a great resource BUT this is a crappy kindle-ization, with some suuuuper annoying errrors, Examples - arc subbing for the word are in numerous spots, indicating possibly a poor scan job. References abound to “opposite page” and are sprinkled throughout the text, disrupting reading. The material is fabulous. I imagine the dead tree version is great. Kindle.... well, I needed the book immediately so I guess I can’t bitch. Someone did a poor job on a good book.",
      "rating": 4.0,
      "verified": true,
      "author": "E. T. Kovacs",
      "helpful_votes": 3,
      "publication_date": 20171115
    },
    {
      "title": "Edible Wild Mushrooms",
      "text": "Excellent photo's to accurately ID those little fungus' out there. Not sure I'm ready to try eating any, but I do like to know what i'm looking at when I run across one. We live in a typically dry area, so most shown in this book I've never seen. Quite interesting. A good study/read for this winter during slower activity.",
      "rating": 5.0,
      "verified": true,
      "author": "Reader On The Open Range",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "Fantastic book...just wish some of the recipe pages were used to teach more mushrooms instead.",
      "text": "Would have given five starts if the recipes didn't take up so much real estate. A guide to storing and general cooking techniques for various kinds would have been better for me, although I could see a lot of people wanting full recipes. I just wish more of those pages were dedicated to covering additional mushrooms. In general descriptions, etc. are excellent. After getting a super beginner book this was my \"level up,\" and it's pretty perfect. Recommend the hardcover version though, you want this one to last for a long time.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom C.",
      "helpful_votes": 2,
      "publication_date": 20151015
    },
    {
      "title": "Mushrooms",
      "text": "\"Edible Wild Mushrooms of North America: A Field-to-kitchen Guide \" (softcover). This is a great field guide and kitchen aid for anyone liking mushrooms. I highly recommend this book to any mushroom lover. But, always remember that recognizing mushrooms for consumption is an event that should take place once you have consulted experts. I joined a mushroom hunting and identification club, because there are many poisonous mushrooms that look similar to edible ones. Get on the internet and look up any mushroom clubs in your area. Signed, Gene A. Godlove",
      "rating": 5.0,
      "verified": true,
      "author": "Gene Godlove",
      "helpful_votes": 0,
      "publication_date": 20081018
    },
    {
      "title": "Nice book on mushrooms.",
      "text": "I like this book for identifying mushrooms. It gives a good amount of information on different types of shrooms.",
      "rating": 4.0,
      "verified": true,
      "author": "SC",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Don't leave  home without  it",
      "text": "Very useful addition to my mushroom library. The author's use of key identification points that eliminate look-alikes is what makes this one stand out. I would have liked more of the introductory information such as expanded explantion of the difference between attached, free and notched gills. Used in coordination with other sources, this volume is indispensible.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Mullinix",
      "helpful_votes": 0,
      "publication_date": 20141207
    },
    {
      "title": "Great Reference for Mushroom Lovers!",
      "text": "I am quite delighted with this book! It contains photographs and detailed information about the edible mushrooms and their inedible \"look-alikes\", so you have a concise guide of what to look for and what to avoid. Color photos are included for all. Also included in this book is a selection of diverse and interesting recipes that include a wide variety of wild mushrooms in them (these also include photos). We have not had a chance to try these recipes yet, but hopefully soon!",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher E. Sonne",
      "helpful_votes": 0,
      "publication_date": 20100422
    },
    {
      "title": "Useful and well written book",
      "text": "This was a gift and was opened up and read and skimmed back and forth and back again before being taken home. A Lot of good and useful information for the mushroom hunter, and cook.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151230
    },
    {
      "title": "I'm still alive",
      "text": "Although no one should eat a wild mushroom unless they are CERTAIN its not poisonous, this book is an excellent resource with great photos to help you avoid eating something that'll kill you, or spending hours collecting mushrooms that don't even taste good.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130706
    },
    {
      "title": "Good book for beginners...",
      "text": "While originally published in 1992, this manual is replete with identifying details for false mushrooms, many of which have dangerous toxicity levels, most of which should be avoided. Recipes are also plentiful.",
      "rating": 4.0,
      "verified": true,
      "author": "MECR",
      "helpful_votes": 0,
      "publication_date": 20161029
    },
    {
      "title": "Mushrooms!",
      "text": "I've been thoroughly studying this book for several weeks and am looking forward to foraging in the woods for some mushrooms this summer and fall. The book gives multiple identifying features for each mushroom both edible and poisonous! A must read for any avid naturalist!!!",
      "rating": 5.0,
      "verified": true,
      "author": "G. Filkins",
      "helpful_votes": 0,
      "publication_date": 20130213
    },
    {
      "title": "Must Have for Mushroom Hunters",
      "text": "Gracious auther was eager to autograph this for me. Well put together, authoritative reference.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20151031
    },
    {
      "title": "Five Stars",
      "text": "This is a nice mushroom book. I bought it used and the shape was very good....",
      "rating": 5.0,
      "verified": true,
      "author": "Thresa",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "Great for Beginners",
      "text": "For a \"first\" book on wild mushrooms I found this one to be very good. The pictures show the top, bottom, stems, colors and different parts of each mushroom. There are \"warnings\" on those that are ediable, but make some people sick, and the NO-NO\"s are equally shown and written about. We're just new at this, and for a \"starter\" book this was just the ticket.",
      "rating": 5.0,
      "verified": true,
      "author": "Michal L. Jones",
      "helpful_votes": 31,
      "publication_date": 20021114
    },
    {
      "title": "Mushroom Hunters",
      "text": "I think this must have been machine done for the kindle. There were several typesetting errors but thé information and pictures were great!",
      "rating": 4.0,
      "verified": true,
      "author": "J. Sampson",
      "helpful_votes": 0,
      "publication_date": 20150907
    },
    {
      "title": "I'm still alive",
      "text": "Having recently moved to North America and not being familiar with all mushrooms growing here, I purchased this guide to help me pick and enjoy wild mushrooms. I'm still alive. Need I say more?",
      "rating": 5.0,
      "verified": true,
      "author": "Guillaume Slama",
      "helpful_votes": 0,
      "publication_date": 20120529
    },
    {
      "title": "great book",
      "text": "Edible Wild Mushrooms of North America is an excellent book with excellent pictures and descriptions. ikt is easy to understand and appears to complete in information for a beginner and expert.",
      "rating": 5.0,
      "verified": true,
      "author": "JayZeeisme",
      "helpful_votes": 0,
      "publication_date": 20140316
    },
    {
      "title": "A good field guide",
      "text": "We have two of these. One lives in the car for those sudden roadside excursions... \"Wait, that's a mushroom!\" Pictures are good, descriptions clear and non-technical. A bit conservative with reference to consumption guidelines, after 5+ years, we have yet to get sick eating from this guide.",
      "rating": 5.0,
      "verified": true,
      "author": "DragonflyDanser",
      "helpful_votes": 2,
      "publication_date": 20130210
    },
    {
      "title": "A good book that could use a bit of updating.",
      "text": "This is a good book. It details the easiest best edible mushrooms for the beginning to intermediate forager. It has a lot of good recipes in the back section. The taxonomy of some of the species has changed so a second edition would be welcome.",
      "rating": 4.0,
      "verified": true,
      "author": "David L. Spahr",
      "helpful_votes": 2,
      "publication_date": 20090305
    },
    {
      "title": "Ready to forage and cook!",
      "text": "This book is great for mid-level mushroom hunters and cooks.",
      "rating": 5.0,
      "verified": true,
      "author": "denise hansen",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Five Stars",
      "text": "Great book and provides the where-with-all on edible mushrooms here in North America.",
      "rating": 5.0,
      "verified": true,
      "author": "John W. Mickey",
      "helpful_votes": 0,
      "publication_date": 20150203
    },
    {
      "title": "Excellent guide",
      "text": "Excellent guide with perfect photographs, easy to read and distinguish text to help identify mushrooms",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa J. Lickel",
      "helpful_votes": 0,
      "publication_date": 20151025
    },
    {
      "title": "Four Stars",
      "text": "Great illustrations. A bit heavy to carry into the field",
      "rating": 4.0,
      "verified": true,
      "author": "Dan M",
      "helpful_votes": 0,
      "publication_date": 20160818
    },
    {
      "title": "Not enough to make you a qualified mushroom gatherer",
      "text": "It is a good book but I dont feel like it gives me enough confidence to go out and pick some wild fungi for lunch. The possible consequences are too great. And this is why I bought the book- so I could go out and gather wild fungi. The book along with some trips with an experienced guide is what I need. The only thing I did not like about the book is that there are too many recipes. I would rather have had more pages devoted to identification.",
      "rating": 3.0,
      "verified": true,
      "author": "Habcores Reader",
      "helpful_votes": 0,
      "publication_date": 20100202
    },
    {
      "title": "Great Book",
      "text": "I found this book to be very helpful. The pictures are crisp and the descriptions are complete. I am a novice so I needed something very descriptive.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey",
      "helpful_votes": 0,
      "publication_date": 20131027
    },
    {
      "title": "Tons of information, clearly written",
      "text": "I have been on one mushroom hunt-for morels. I loved it and hope to join a mushroom club soon. Cannot wait to use this in the field.",
      "rating": 5.0,
      "verified": true,
      "author": "Southern Gardener",
      "helpful_votes": 0,
      "publication_date": 20130111
    },
    {
      "title": "Great Book!",
      "text": "Great book! Written in plain English so that it can be used easily and understood clearly. Good info inside, probably my best purchase so far on the subject. Clear information to help identify wild mushrooms in my area. The book arrived ahead of estimated time and in great condition (supposedly used) but in perfect shape. Thank You!",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Plummer",
      "helpful_votes": 0,
      "publication_date": 20131020
    },
    {
      "title": "Great photos and great recipes",
      "text": "This is just what the title promises. Lots of good photos and accurate information for the begginner and novice alike. Nice section of mushroom recipes.",
      "rating": 5.0,
      "verified": true,
      "author": "David Babik",
      "helpful_votes": 0,
      "publication_date": 20130301
    },
    {
      "title": "Best shroom book we have",
      "text": "This is the best mushroom book we have so far. Nice pictures, complete, no fuss. Tje author has an excellent website to boot.",
      "rating": 5.0,
      "verified": true,
      "author": "Shakirah C. Hemstrom",
      "helpful_votes": 0,
      "publication_date": 20130107
    },
    {
      "title": "GREAT Shroomers book!",
      "text": "GREAT book for finding edibles. Good Pics, Great Definitions. IF it were a bit smaller, would be a great field guide, still fits in a backpack or carry bag tho!",
      "rating": 5.0,
      "verified": true,
      "author": "CT Shopper",
      "helpful_votes": 0,
      "publication_date": 20131108
    },
    {
      "title": "Mushroom book",
      "text": "While I haven't had the chance to read this book as yet. I have looked it over and it is full of information for the person wanting to learn more about mushrooms.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Miller",
      "helpful_votes": 0,
      "publication_date": 20131002
    },
    {
      "title": "useful book",
      "text": "I like that there are recipes included with the pictures of mushrooms. I plan on keeping it with my mushroom picking bag.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20130918
    },
    {
      "title": "very useful",
      "text": "Was quick to get and came in excellent condition. Using it now with all the mushrooms popping up around my area.",
      "rating": 5.0,
      "verified": true,
      "author": "Desma Charles-Forrester",
      "helpful_votes": 0,
      "publication_date": 20130904
    },
    {
      "title": "MMMMMMMMMMMMMGood",
      "text": "Lovely photographs, excellent identity descriptions, tons of useful information and I love the recipes -- plan to make every one of them.",
      "rating": 4.0,
      "verified": true,
      "author": "Gundi Jeffrey",
      "helpful_votes": 2,
      "publication_date": 20060725
    },
    {
      "title": "eh.........",
      "text": "not quite what I expected. Ok, but probably wouldnt recommend it to a serious shroom hunter. there are a lot better choices out there.",
      "rating": 3.0,
      "verified": true,
      "author": "Kim I Cox Sr.",
      "helpful_votes": 0,
      "publication_date": 20130826
    }
  ],
  "product_meta": {
    "title": "Edible Wild Mushrooms of North America: A Field-to-kitchen Guide",
    "rating": 4.6,
    "specifications": {
      "Item Weight": "1.75 pounds",
      "ISBN-10": "0292720807",
      "Paperback": "264 pages",
      "ISBN-13": "978-0292720800",
      "Publisher": "University of Texas Press; Not Stated Edition (August 1, 1992)",
      "Product Dimensions": "9.89 x 7.05 x 0.6 inches",
      "Language:": "English",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Biological Sciences",
      "Books",
      "Science & Math"
    ],
    "price": ""
  }
}