{
  "website_summaries": [
    {
      "verdict": "This is a very informative and well-organized field guide detailing wildflowers of Western North America.",
      "pros": [
        "Book is organized by color of plant, which makes it interesting and easy to go through, especially given color-coded page corners",
        "Includes color images",
        "Showcases quality maps",
        "Possesses a useful glossary"
      ],
      "cons": [
        "Some included photos focus on only the flower rather than entirety of the plant"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "My Go-To Flower Guide",
      "text": "Love this book - my go to for basic flower identification. I live in Northwest Montana and so far I’ve been able to find almost everything I’ve wanted to identify. Easy to use and gives good basic information about each species.",
      "rating": 5.0,
      "verified": true,
      "author": "Geneva Thompson",
      "helpful_votes": 8,
      "publication_date": 20181027
    },
    {
      "title": "Very useful, informative and well organized.",
      "text": "This little book has a ton of useful information. I like the way it's organized (by color) the author was pretty creative on that one. A real, in color photo of each plant and a brief description about the plant and where to find it. Leave it to the Audubon Society to come up with a real winner.",
      "rating": 5.0,
      "verified": true,
      "author": "MaryB",
      "helpful_votes": 6,
      "publication_date": 20180728
    },
    {
      "title": "Fun!",
      "text": "I bought this to look up the different wildflowers on our property. I love it! I go hunting for new flowers so I can look them up and find out more about them. The National Audubon Society Field Guides are always high quality - with great pictures and descriptions. The \"plastic\" cover is also a blessing so you don't have to worry about dirt or moisture. I only regret not getting it sooner!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Holland",
      "helpful_votes": 2,
      "publication_date": 20200720
    },
    {
      "title": "Great!",
      "text": "My son wanted this to help identify plants he sees while hiking. The book is a little heavy to take hiking and I was worried about that, but he takes pictures of plants and says he'll be able to identify them when he gets home. Very detailed. I don't hike, but I'd like one.",
      "rating": 5.0,
      "verified": true,
      "author": "J. L.",
      "helpful_votes": 3,
      "publication_date": 20200102
    },
    {
      "title": "Damaged Item Delivered :(",
      "text": "This is a good book, but I was delivered a copy with a torn cover. So disappointing. Ordering a replacement because the cover is torn is unnecessarily adding to carbon emissions...yet, I did pay full price for a damaged item. Catch 22 and upsetting.",
      "rating": 1.0,
      "verified": true,
      "author": "E.C.L.",
      "helpful_votes": 3,
      "publication_date": 20190407
    },
    {
      "title": "Flowers by color=easy to find your plant",
      "text": "This guide is easy to use. Flowering plants are grouped by the color of the flower, and within the color, by the form of the flower. Good range maps, and good description. I would have liked more views of the entire plant, not just the flower. Otherwise excellent for botanizing, which I do full bore in our short spring and summer seasons.",
      "rating": 5.0,
      "verified": true,
      "author": "Doc W8",
      "helpful_votes": 7,
      "publication_date": 20140627
    },
    {
      "title": "Great Resource Book on Wildflowers",
      "text": "This is a must have resource book for beginning to understand and identify Wild flowers...Although it is not the final chapter in identification it sure will get you started and is easy to follow and categorize. The images and corresponding icons flow brilliantly for ease of identification...Fits nicely in the Saddle Bag or field pocket of and explorer jacket and is very durable and colorful...I carry it every time I saddle up in the high country of the Cascades...to the deserts of the northwest...Photographer William J. Erickson [...] [...]",
      "rating": 4.0,
      "verified": true,
      "author": "copperhorse",
      "helpful_votes": 3,
      "publication_date": 20111105
    },
    {
      "title": "National Audubon Society Field Guide to North American Wildflowers: Western Region",
      "text": "I bought this as a second copy to keep in our trailer along with other Audubon guides that I also own. Buying them used made the cost minimal. I like the Audubon guides more than other guides because of the pictures instead of drawings and the vinyl covering. I have bought several Audubon guides from several used sources and was stunned to get a couple of them that looked like they have never been used and they all showed withing four days..",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Cantrell",
      "helpful_votes": 5,
      "publication_date": 20140311
    },
    {
      "title": "Book arrived in excellent condition - just as it was described on Amazon.",
      "text": "Book is a clean, almost new copy and described well and truthfully. Good service, fast service. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Della",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Awesome buy!",
      "text": "Most helpful identification book I have to date. The glossary explains how to identify plants and flowers by their petal arrangement as well as stalk and leaf placement. Awesome buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina Heydt",
      "helpful_votes": 2,
      "publication_date": 20150627
    },
    {
      "title": "Inclusive and Well Designed",
      "text": "I like flowers and this guide is really helpful when picking out what will grow well in my region. The guide is easy to use and well organized.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "Good overall guidebook",
      "text": "Still missing a few plants and flowers, but overall a good guidebook covering CA and other states. So far I've only used it for California and Utah.",
      "rating": 4.0,
      "verified": true,
      "author": "s.kittyCA",
      "helpful_votes": 0,
      "publication_date": 20160709
    },
    {
      "title": "This is an excellent guidbook if you are interested in identifying flowers in ...",
      "text": "This is an excellent guidbook if you are interested in identifying flowers in the field. It is compact but not tiny, and the photography is excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Tara Kron",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Beautiful",
      "text": "Ordered this as a gift for someone and they loved it. Very clear photos and descriptions.",
      "rating": 5.0,
      "verified": true,
      "author": "UnusualRabbit",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Five Stars",
      "text": "Always a pleasure to have any of the Audubon books. They are very well researched and assembled.",
      "rating": 5.0,
      "verified": true,
      "author": "CK",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "Mystery plants",
      "text": "Maybe I'm just too much of a novice, but in trying to sleuth out plant taxonomy, this book doesn't help as much as I would like. It has plenty of full color plates, but a number of wildflowers growing on my acreage are still not identifiable to me.",
      "rating": 3.0,
      "verified": true,
      "author": "Julia S",
      "helpful_votes": 0,
      "publication_date": 20140710
    },
    {
      "title": "Another good one from Audubon.",
      "text": "Photos ate numerous, descriptions, classification, families. It's there. Great maps. What can I say? It's Audubon.",
      "rating": 5.0,
      "verified": true,
      "author": "Louise in CA",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "Name That Wildflower!",
      "text": "Last spring break, armed with my camera but no guidebook, I snapped dozens of gorgeous but unidentified wildflower photos in the Sonoma countryside. This handy guide has helped me name all but one of the wildflower pictures! The book is well-organized (flowers are grouped by color). And the book's size is perfect for stashing in my daypack next spring!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Graham",
      "helpful_votes": 0,
      "publication_date": 20091215
    },
    {
      "title": "Good field guide",
      "text": "Good field guide, but I find I need others to fill in the blanks. Worthy of adding to your library at any rate.",
      "rating": 4.0,
      "verified": true,
      "author": "Lawrence L. Brown",
      "helpful_votes": 0,
      "publication_date": 20160805
    },
    {
      "title": "National Audubon Society Field Guide to North American Wildflowers: Western Region - Revised Edition (National Audubon Society F",
      "text": "As in all the National Audubon Society Field Guides the book is great. National Audubon Society Field Guides are my favorite of all the guide books. The color photos are clear and close up for easy identification of the plant. Descriptions are in-depth for information and assistance in identification. I highly recommend this book.",
      "rating": 5.0,
      "verified": true,
      "author": "J D W",
      "helpful_votes": 0,
      "publication_date": 20070627
    },
    {
      "title": "good quality always",
      "text": "more than one purchase of this book. beautiful and easy to find what you are looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Lucy ",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "The book is easy to use.",
      "text": "We had used this book when my children were young and were identifying flowers. I have since also bought other books with more and different flowers. However, when I loaned this book to my grandkids and saw that they were using it so much and that I wasn't getting it back, I just needed my own for some of the information and for the easy identification of some of the flowers that I'd forgotten.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna M. Mcmath",
      "helpful_votes": 0,
      "publication_date": 20130709
    },
    {
      "title": "requisite",
      "text": "this is a wonderful book! it is requisite for any nature hike. very beautiful plates of a multitude of flowers. arranged by color for easy locating. i loved it so much that i bought a second one for a gift. highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "pumps100",
      "helpful_votes": 0,
      "publication_date": 20140429
    },
    {
      "title": "BEAUTIFUL FLOWER GUIDE FOR WESTEREN STATES .",
      "text": "SPENT TWO WEEKS WITH UNCLE IN SNOWY MOUNTAINS WEST OF LARIME WOYOMING SEARCHING OUT ALL THE DIFFERENT FLOWERS WE FOUND , SO GLAD WE HAD THE BOOK , BEAUTIFUL PICTURES MAKING IT EASY TO ID THEM .",
      "rating": 5.0,
      "verified": true,
      "author": "Connie Wiesehan",
      "helpful_votes": 0,
      "publication_date": 20130904
    },
    {
      "title": "National Audubon Society Wildflowers guide.",
      "text": "This was a gift to a daughter who had just planted a acre of prairie Flowers. She loves that she can identify by the color of the flower. Makes identifying easy. Beautiful pictures of Wildflowers.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose M.",
      "helpful_votes": 0,
      "publication_date": 20131002
    },
    {
      "title": "Five Stars",
      "text": "Wonderful resource book for wildflowers. Love all of the pictures and descriptions.",
      "rating": 5.0,
      "verified": true,
      "author": "Fusion Bear",
      "helpful_votes": 0,
      "publication_date": 20150506
    },
    {
      "title": "I skimmed through it a few times and it looks like it has a ton of information",
      "text": "I bought this for my biologist wife and she loves it. I skimmed through it a few times and it looks like it has a ton of information!",
      "rating": 5.0,
      "verified": true,
      "author": "Parceiro",
      "helpful_votes": 0,
      "publication_date": 20150726
    },
    {
      "title": "Always the best",
      "text": "National Audubon Society always puts out great handbooks, this is one of them. I use it and love it.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Krig",
      "helpful_votes": 0,
      "publication_date": 20150917
    },
    {
      "title": "Not for myself.",
      "text": "This is a gift, so I haven't seen it but I know the Audubon Guides are excellent!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary O'Hare Walsh",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "This book is beautifully illustrated with photos of animal tracks",
      "text": "Beautiful illustrations of all the flowers. Color coded for ease of identification. There are a few flowers I am unable to locate but for the most part it is well done.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160615
    },
    {
      "title": "Four Stars",
      "text": "Better than average field guide. Clear, complete photos, and detailed descriptions.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160814
    },
    {
      "title": "I can't wait to identify flowers this summer!",
      "text": "I love to go out for long horseback rides in the spring and summer when the wild flowers are blooming and I can't wait to be able to try identifying some of the flowers I don't know and hopefully I will find some of the rare ones that only occur in my area (SW Idaho)",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Floerchinger",
      "helpful_votes": 0,
      "publication_date": 20130116
    },
    {
      "title": "you will like this.",
      "text": "If you are used to the manner in which NAS organizes its filed guides, you will like this.",
      "rating": 4.0,
      "verified": true,
      "author": "Neil G.",
      "helpful_votes": 0,
      "publication_date": 20150112
    },
    {
      "title": "Great for general curiosity",
      "text": "This book is great for those who like to know what they're looking at when they're out on a hike away from home. Since it covers the entire western U.S., it won't have every single flower you come across, but it can often help you get at least to the right family. I have a book that covers every single plant that I could come across right around where I live, but when I go more than a couple hours from home, this is a fun book to have. Great pictures, and great info on each plant in the back.",
      "rating": 5.0,
      "verified": true,
      "author": "Right Here",
      "helpful_votes": 0,
      "publication_date": 20070705
    },
    {
      "title": "Amazing",
      "text": "I grew up loving Audubon's Field Guides this one is no different. One of the best guides out there. Vibrant colors and easy format for anyone to learn.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria schmied",
      "helpful_votes": 0,
      "publication_date": 20130607
    },
    {
      "title": "Five Stars",
      "text": "Wonderful pictures make it easy to identify plants and not too big to take along in the backpack.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Allen",
      "helpful_votes": 0,
      "publication_date": 20150607
    },
    {
      "title": "Book arrived in excellent condition.",
      "text": "We bought it for a neighbor who raises many types of flowers and she was very pleased. It's a beautiful book.",
      "rating": 5.0,
      "verified": true,
      "author": "Artsgirl",
      "helpful_votes": 0,
      "publication_date": 20130218
    },
    {
      "title": "Great resource",
      "text": "Great resource. Well organized. Makes it easy to identify the flowers on my property. Bought the Audubon bird book as well",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin Raggio",
      "helpful_votes": 0,
      "publication_date": 20150627
    },
    {
      "title": "Four Stars",
      "text": "It is a good book too. It is easy to understand.",
      "rating": 4.0,
      "verified": true,
      "author": "Jean E. Rhynard",
      "helpful_votes": 0,
      "publication_date": 20150704
    },
    {
      "title": "Great book!",
      "text": "An excellent book for anyone who loves wildflowers and wants to know more about them. I had one previously, as well as the bird and tree guides so was delighted to own it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann R Campbell",
      "helpful_votes": 0,
      "publication_date": 20130502
    },
    {
      "title": "Wildflowers: Western Region by Audubon Society",
      "text": "This is an excellent reference book for those interested in identifying wildflowers. It is well organized and is the right size to carry into the field.",
      "rating": 5.0,
      "verified": true,
      "author": "Nazhiyath Vijayan",
      "helpful_votes": 0,
      "publication_date": 20061103
    },
    {
      "title": "Excellent Field Guide",
      "text": "Got this as a gift. Is perfect except that it was just tossed in the box with my other purchases and the cover and several pages got bent. I took 1 star off to reflect my displeasure about that. The book itself gets 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "K. Ross",
      "helpful_votes": 0,
      "publication_date": 20160618
    },
    {
      "title": "fast and reliable",
      "text": "The book arrived quickly and in the condition as described. It was a pleasure doing business with this seller.",
      "rating": 5.0,
      "verified": true,
      "author": "imh23",
      "helpful_votes": 0,
      "publication_date": 20100913
    }
  ],
  "product_meta": {
    "title": "National Audubon Society Field Guide to North American Wildflowers: Western Region",
    "rating": 4.7,
    "specifications": {
      "Vinyl Bound": "896 pages",
      "ISBN-10": "0375402330",
      "ISBN-13": "978-0375402333",
      "Publisher": "Knopf; Revised Edition (April 3, 2001)",
      "Product Dimensions": "4.2 x 1.3 x 7.7 inches",
      "Item Weight": "1.3 pounds",
      "Language:": "English",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Books",
      "Gardening & Landscape Design",
      "Crafts, Hobbies & Home"
    ],
    "price": ""
  }
}