{
  "website_summaries": [
    {
      "verdict": "Will open the minds of those looking to diversify their investment portfolios with high-level information and common sense strategies.",
      "pros": [
        "Investment strategies for the sophisticated investor or students who are prepared for a book packed with information",
        "While there are a breadth of investment concepts, each are written with an action plan that readers can implement in real life"
      ],
      "cons": [
        "Does require some prior knowledge of markets and investment strategy to gain the most from this book"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Magnificent Introduction into Index Investing",
      "text": "When I first picked this book up, I thought it'd be like the other gimmicky investment books you see everywhere...but was I wrong! This book is an excellent introduction into index investing by taking you through the history of stock markets, schools of thought, failed strategies, historical proof of index investing, and applications. I highly recommend this book to the beginner and time-tested investor alike.",
      "rating": 5.0,
      "verified": true,
      "author": "Dakotah Hogan",
      "helpful_votes": 8,
      "publication_date": 20180903
    },
    {
      "title": "I don't know if this book will help me make ...",
      "text": "I don't know if this book will help me make money in the stock market but it has given me confidence to invest regularly. Malkiel repeats his mantra of investing in low-cost, broad-based indexes repeatedly and convincingly but also clearly explains many other investing options with their advantages and disadvantages. This is also not the dry textbook I expected. The humor and levity in the writing, in addition to the rich information, made reading this book pleasurable.",
      "rating": 5.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 5,
      "publication_date": 20180506
    },
    {
      "title": "' this is the only other book I think I really got good, sound",
      "text": "This is THE book of books for any regular guy wanting to learn about most, if not all, types of investing. Save yourself time and money and just get this book. You will have no need to read another investing book...ever. With the exception of 'The Millionaire Next Door,' this is the only other book I think I really got good, sound, and useful advise from. It's a ten star book (twice as good as the best investments books I've read)",
      "rating": 5.0,
      "verified": true,
      "author": "Rankle1",
      "helpful_votes": 7,
      "publication_date": 20170210
    },
    {
      "title": "A good analysis of the financial world.",
      "text": "The author explicates with great passion and efficientness the most important charactersistics of this model. We are in the context of the Hypothesis of Efficient Market (HEM), By a mathematical view we consider the importance of the random walk. Surely there is psychological factors next those behaviors. In last analysis a book well written with attention to all that works in economics.",
      "rating": 4.0,
      "verified": true,
      "author": "Edoardo Angeloni",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Best financial book you can get",
      "text": "This book has been a real eye opener, and it is now my favorite book on the topic of investing. All the typical basic topics for novice investors to those seeking to expand their knowledge are covered. Also covered is the rationale behind the data and stories, common pitfalls and traps, and the \"teach a man to fish\" approach. If I had one issue with the book, it would be that portfolio construction could use more coverage but I suppose that could be several volumes of its own.",
      "rating": 5.0,
      "verified": true,
      "author": "---K---",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "No better book for new investors",
      "text": "Bought a pair of these to give to my young adult children one Christmas. Got some very funny looks. Now that they have read the books, they are excited about smart investing for their future and we have another common area of discussion. A shame that personal finance is not a required course taught at schools or universities.",
      "rating": 5.0,
      "verified": true,
      "author": "melissa snyder",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Comprehensive look at investment strategies",
      "text": "While I'll admit that the author recommends an investment strategy that I already believe in and practice, he also introduces a variety of other strategies, some of which I didn't know of previously or understand completely. While probably not the first book a novice investor should read, it certainly should be in the rotation after an adequate foundation of basic investment theory is established.",
      "rating": 5.0,
      "verified": true,
      "author": "Haolezeus",
      "helpful_votes": 2,
      "publication_date": 20170429
    },
    {
      "title": "A good start",
      "text": "Great read or listen. Provides a lot of good information on how to invest and what you might expect in return. Audiobook does not cover derivatives and options calls. So you need to read the last 20% of material yourself.",
      "rating": 4.0,
      "verified": true,
      "author": "FilipM",
      "helpful_votes": 3,
      "publication_date": 20180301
    },
    {
      "title": "Awesome and practical baseline book for investing",
      "text": "I wish I had read this years ago. Burton Malkiel provides the reader with a firm foundation of investing fundamentals backed up with a lot of data and historical context. He arms the reader with knowledge of terminology and some key philosophical approaches to investing. Most importantly, the reader will develop a healthy skepticism about various investment products and approaches that are often touted by the industry today. As near as I have come to a \"life changing\" read.",
      "rating": 5.0,
      "verified": true,
      "author": "RBH",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "I really liked this book",
      "text": "I really liked this book. I am a recent college grad who never took a business/finance class and I found this book to be very helpful. Once I get my highest interest student loans paid off in the next year or two I will definitely be following a lot of the advice in this book when I set up my retirement and investment accounts. I will admit the middle of this book kind of drags a bit but the beginning and the end are packed with lots of informative material.",
      "rating": 5.0,
      "verified": true,
      "author": "Logan",
      "helpful_votes": 12,
      "publication_date": 20160531
    },
    {
      "title": "Excellent Financial Market Overview and Detail Descriptions",
      "text": "I think, a complete and detailed overview of Wall Street. Ideal for those beginning investors, and for those who want a thorough overview of the Financial Markets. It could also be used as a Reference Book going to specific product descriptions each with their pros and cons. I treasure this book.",
      "rating": 5.0,
      "verified": true,
      "author": "James J. Henry, Jr.",
      "helpful_votes": 4,
      "publication_date": 20160204
    },
    {
      "title": "Ok, No new information",
      "text": "He clearly has a bias. It runs on with alot of studies with not alot of depth. The whole intro is basically: Diversify and you should create your own indexes. This book is not really geared towards experienced investors but instead to the typical bystander.",
      "rating": 3.0,
      "verified": true,
      "author": "peter rigali",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "If you're looking for get-rich-quick investment advice, this ain't it.",
      "text": "By the man who suggested the concept of index mutual funds before they existed. A favorite book of Jack Bogle, founder of Vanguard funds and generally considered the father of index funds. As an engineer, I love the fact that Mr. Malkiel backs up his investment advice with plenty of data and clear analysis of all the major competing approaches to investing. Takes some concentration and effort to get through all of the analysis, but it's pretty easy to get to the bottom line - NOBODY beats the market averages for the long haul, but you don't have to to build significant wealth.",
      "rating": 5.0,
      "verified": true,
      "author": "Clifford Smith",
      "helpful_votes": 9,
      "publication_date": 20160810
    },
    {
      "title": "The best book on investing I have ever read",
      "text": "The best book on investing I have ever read. If you are at all interested in finance or investing you will not be able to put this book down. Malkiel is an investing genius who debunks so many theories. Really pinpoints how to create a solid portfolio. Many advanced aspects are also covered in this book.",
      "rating": 5.0,
      "verified": true,
      "author": "Adamwalsh21",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Great for Finance Folks, New and Old",
      "text": "One of my new favorite books for investing. Essentially Makliel runs you through every major speculative bubble in history [even back through the 1500's!], and tries to make that point that making money in investing isn't the hard part, yet keeping your money from being swept up in market mania is. Great for a seasoned student in finance or someone looking to get an introduction into investing.",
      "rating": 5.0,
      "verified": true,
      "author": "VTHokies",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "He gives a great example of how flipping a coin will give a ...",
      "text": "If you trade stocks, you must read this. Swing or Day trader. He gives a great example of how flipping a coin will give a random chart that looks like something, but it was just random and independent. Dispels a lot of myths out there. This $15 book could save or make you 1000s.",
      "rating": 5.0,
      "verified": true,
      "author": "Albert Johnson",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Reality check",
      "text": "Well written, easy read. Straight forward, not fancy info. Some surprising revelations if you though you could beat the market. Don’t kid yourself and leave the losing, I mean gambling to someone else.",
      "rating": 5.0,
      "verified": true,
      "author": "Lew",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Excellent investment book",
      "text": "The author writes about investing in a way that is easily understood and he does it with a sense of humor as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Dale Frasier",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "A good read for young investors. The more experienced readers will like the end chapters.",
      "text": "Interesting information for those trying to invest. Only issue is the statement to consistently make good investment returns for the long haul is to buy index funds. Works if you have many years to grow funds. Most folks start later in life and need something to help fight inflation. At end of his book the author gives good information.",
      "rating": 4.0,
      "verified": true,
      "author": "J2018G",
      "helpful_votes": 3,
      "publication_date": 20150414
    },
    {
      "title": "Always have Book in your Investment Library!",
      "text": "I read so often, I sometimes think that once in a while I should read something that might materially benefit me. ONe of the top 5 Investing Bibles in everyone collection!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian L",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "An excellent read for anyone interested in investing",
      "text": "This was an extremely well written book that defines important financial nomenclature (e.g., efficient market hypothesis, modern portfolio theory, arbitrage, etc, etc) in a very easy to understand way. I applaud the author for devoting so many years to so many editions of this fine book. In sum, Burton Malkiel emphasizes that passive, indexed investments will be actively managed portfolios in the majority of cases. A classic whose recommendations for investment have stood the test of time.",
      "rating": 5.0,
      "verified": true,
      "author": "Christie",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "All Time Favorite Financial Book",
      "text": "My all time favorite financial book updated with lots of recent knowledge. Read it and make sure your financial adviser has read it. Following its advice has probably saved me vast amounts of money in fees and bad investment decisions.",
      "rating": 5.0,
      "verified": true,
      "author": "AJGB",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "I LOVE IT",
      "text": "I'll admit this book is pretty dense, but I LOVE IT. I've learned more from this one book than I have from several others in its category. The best part is the advice still applies today!",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny L",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "This is Fundamental reading for all equity investors. I ...",
      "text": "This is Fundamental reading for all equity investors. I first read this book about 25 years ago, it served me well. Just bought the new edition as a refresher and for all the new material it added. The book is not only academically sound, intellectually rigorous, but also gives practical, actionable advices, a rare combination. Especially valuable for young investors who can benefit from buy and hold strategies.",
      "rating": 5.0,
      "verified": true,
      "author": "leon zhao",
      "helpful_votes": 0,
      "publication_date": 20171007
    },
    {
      "title": "Learning my options",
      "text": "This was something I wanted to read or see a technique used for my studies. I liked what a read or viewed.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaime S",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "This book has been awesome in helping ease my mind into the world of ...",
      "text": "I am a 29 year old father returning to college, working towards a major in Finance. This book has been awesome in helping ease my mind into the world of finance. A friend of mine, who works as a Senior Consultant, told me that this book is great for anyone looking for a better understanding of how finance/stocks/investments work. I couldn't agree more, highly recommend this book to anyone working in the field or anyone who would like to learn more about finance and how investments of all sorts work. Amazing book.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 11,
      "publication_date": 20160731
    },
    {
      "title": "A must read for all levels of investors",
      "text": "Whether you have tens of thousands to invest or just $20 a month, this is an invaluable guide to navigate the choices ahead of you. My late father introduced me to the book in the early 90's and I read it again now 15 years later. Its one of the few books I'll read through multiple editions knowing that there is a great financial return on investment every time I read it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharp",
      "helpful_votes": 0,
      "publication_date": 20150731
    },
    {
      "title": "A classic--must read for the causal investor",
      "text": "This is a wonderful book--it has just gotten TOOOOOOOOO long. He could easily cut the size without hurting the content. Still, a MUST read for any investor.",
      "rating": 4.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "interesting and educational",
      "text": "this takes you from the orgins of the stock market to present day. very interesting look at how the market responds to government intervention and irrational exhurberhance of the human spirit",
      "rating": 5.0,
      "verified": true,
      "author": "Brosnan",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "This book was perfect - easy to read",
      "text": "I am in the process of retiring and setting up my investments to meet my family's needs for the next few years on a lower income. This book was perfect - easy to read, sensible, and fits my amateur experience in the stock market over the last 30+ years. I wish I would have read this book many, many years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "JCleveland",
      "helpful_votes": 2,
      "publication_date": 20170127
    },
    {
      "title": "you'll do fine as long as you learn",
      "text": "A very encouraging book for the unsure investor. Common sense is all you need to do reasonably well. Do your homework and, with practice, you'll do fine as long as you learn, with practice, to recognize the charlatans",
      "rating": 5.0,
      "verified": true,
      "author": "valeria scioscioli",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "\"Res tantrum valet quantum vending potest\" ~BGM",
      "text": "If you're looking for a get rich quick scheme, don't buy this book. If you're in this for the long run, perfect strategies, and challenges multiple theories and research done by other experts in the field of the Financial Market. I read it often, and listen to the audio daily.",
      "rating": 5.0,
      "verified": true,
      "author": "JBoogi",
      "helpful_votes": 0,
      "publication_date": 20171007
    },
    {
      "title": "Best investment book ever written",
      "text": "Sound investment advice. The first edition (1973) guided my investments for many years and I wanted to get an update with the 2015 edition. Best investment book ever written!",
      "rating": 5.0,
      "verified": true,
      "author": "Sammy",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "Best Investing Book I Have Read",
      "text": "I would highly recommend reading both this and The Intelligent Investor by Benjamin Graham. These two books will tell you everything you need to know about investing on your own.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 2,
      "publication_date": 20160717
    },
    {
      "title": "but also a lot of good advice for investors",
      "text": "Must reading for anyone with interest in investing. A lot of insight on the market, i.e. the whys and the wherefores of market behavior, but also a lot of good advice for investors, even if one does not care about the reasons for market behavior. This book will not make one a multimillionaire, but it probably will lead to reasonable and steady returns on ones investments.",
      "rating": 5.0,
      "verified": true,
      "author": "Tommy Z",
      "helpful_votes": 0,
      "publication_date": 20150801
    },
    {
      "title": "Gret book on Investing,",
      "text": "If you are into investing and haven't read this already, please do. Very insightful and practical.",
      "rating": 5.0,
      "verified": true,
      "author": "Obaida Sakib",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "A must read for investors",
      "text": "Its a must read if you plan or already have money in stock market. It will make you understand past historical event and you will be able to spot new ones as they come.",
      "rating": 5.0,
      "verified": true,
      "author": "Pravin Pathak",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Comprehensive Investment Walk Through",
      "text": "Everything about investments was tackled in a very interesting & realistic way. Th book covers various type of investments, mostly applicable for the US financial markets, comparing, showing the pros & cons, guiding the reader to the best suitable plan. The most important point is the myth-busting cross the history of the markets.",
      "rating": 5.0,
      "verified": true,
      "author": "Saad H",
      "helpful_votes": 0,
      "publication_date": 20150419
    },
    {
      "title": "Good Book",
      "text": "I have read read through yet; however, I felt it was just another stock market book. I did not remember what I have read.",
      "rating": 5.0,
      "verified": true,
      "author": "Nai",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "Fantastic book - more about philosophy than fundamentals",
      "text": "I am trying to force myself to learn about finance and investing, as someone who is *not* interested in those things at all. This book is so interesting though! The format of stories and historical anecdotes is great, I even found myself talking finance with 'the guys' on my last family vacation when telling them about this book. The only downside is that it does assume a basic knowledge of some of the foundation concepts in investing, so some concepts I either have to learn about elsewhere or just skim over without 100% 'getting' what the author is talking about.",
      "rating": 5.0,
      "verified": true,
      "author": "BookLover",
      "helpful_votes": 4,
      "publication_date": 20170804
    },
    {
      "title": "A blind folded monkey throwing darts at the stock listings could do better than a so called expert.",
      "text": "This is a really good book. It is one of the better investment books I have read. He is an evangelist for passive index investing based on the efficient markets theory. He has a chapter on smart beta. He does not believe in smart beta. He has changed his mind recently. Now he thinks that sophisticated algorithms that drive computer generated trading can beat the market.",
      "rating": 4.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20170704
    },
    {
      "title": "Good understandable review of investment theory",
      "text": "Solid rational advice for the accumulation phases of retirement. The supplemental addition of explanations regarding derivatives, margins, futures may also appeal to more sophisticated investors (or those who wish to be).",
      "rating": 4.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Amazing Book! Really taught me how to invest and ...",
      "text": "Amazing Book! Really taught me how to invest and how not to invest. Really outlines many different aspects to investing and explains the different strategies behind Wall Street. This is a must read!",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriel E.",
      "helpful_votes": 0,
      "publication_date": 20160917
    },
    {
      "title": "Safely remove your portion from the Stock Market's safe",
      "text": "A perfect book to guide any investor through the annals of the complicated world of investments, so that you wind up with long-term success by taking your share of market returns while protecting your downside. Burton Malkiel gives you the secret code to open the stock market's safe and safely remove your portion.",
      "rating": 5.0,
      "verified": true,
      "author": "timothy sullivan",
      "helpful_votes": 0,
      "publication_date": 20170128
    },
    {
      "title": "Informative stuff",
      "text": "An amazing book giving an insight about various money market instruments. It also talks about the various factors that impact decision making for an individual investor. One should definitely read it before getting into investment. It can add to one’s information related to personal finance.",
      "rating": 4.0,
      "verified": true,
      "author": "Naval Pandey",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Good book",
      "text": "Good simple book on stock investment, although it is a little basic. Efficient market hypothesis isn't nearly as sound as he wants it to be",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Comprehensive and easy to read",
      "text": "- Easy to read - Concrete advice with examples, and explanations for people in differnet stages of their lives. The only thing I would have liked although not the target of the book, is how to handle investing in other countries. for example say a European country, how much do you put in local currency? in Euro? in USD?",
      "rating": 5.0,
      "verified": true,
      "author": "Hector38",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "very good investing book for beginners",
      "text": "good investing book with short stories of economic situations. Easy to comprehend",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "Loved this book",
      "text": "Loved this book. It was easy to read and very informative. It doesn't bog you down with too much technical info or excess math. It gives you just enough to get the points across and make you understand the underlying principles.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Good book for medium knowledge investment people",
      "text": "Great review of finances and ideas on how to best make use of your money and it seems pretty up to date with the various investment products out there today.",
      "rating": 5.0,
      "verified": true,
      "author": "John  Twain",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Good take on the markets",
      "text": "Don't agree with everything it says but it's a great read.",
      "rating": 5.0,
      "verified": true,
      "author": "hector",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Good read.",
      "text": "It's a must read for those interested in the stock market. Very scholarly, and sometimes boring. The point of the author is people cannot beat the market. But in the clouding chapters gives advise on how to pick stocks.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Lee Greiner",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Latest edition of the best single guide available",
      "text": "Still the clearest and best single book on the machinations of Wall Street, investing and individual strategies. I re-read from time-time (in recurring updated editions) and this last season made this a Christmas gift to my two sons-in-law and daughters.",
      "rating": 5.0,
      "verified": true,
      "author": "Montana Skyline",
      "helpful_votes": 0,
      "publication_date": 20150409
    },
    {
      "title": "Great book",
      "text": "One of the must read books. As the author says, 95% of information one reads or obtains is worth nothing. He does a great job making sure that the information contained in this book falls in the 5% category.",
      "rating": 5.0,
      "verified": true,
      "author": "Rasul",
      "helpful_votes": 0,
      "publication_date": 20160514
    },
    {
      "title": "The one book to acheive wealth in today's world.",
      "text": "If you can read only one book about investing, this is the one to read! An excellent history of markets and how to succeed in today's market. Investing in a low cost broad based index fund along with systematic saving is the way to wealth today and for the future.",
      "rating": 5.0,
      "verified": true,
      "author": "F. Mange",
      "helpful_votes": 0,
      "publication_date": 20150212
    },
    {
      "title": "Important Financial Insight ...",
      "text": "In my opinion this book is one of the most important guides for the average person seeking an education on managing their financial well being. An excellent book for the person that is weary of needing to rely too much on so-called 'professionals' to look out for your best interest first and foremost. It is well written, revised over the years and is a pleasant read, especially for those of us who have a short attention span when it comes to financial talk. It will give the reader a better overall understanding of the financial process and therefore will help with the choices for wise investing by the novice.",
      "rating": 5.0,
      "verified": true,
      "author": "J Robin",
      "helpful_votes": 4,
      "publication_date": 20150420
    },
    {
      "title": "Ripped pages",
      "text": "The cover page and first few pages seem like it has been chewed by a rat or a racoon",
      "rating": 1.0,
      "verified": true,
      "author": "Umed",
      "helpful_votes": 2,
      "publication_date": 20181031
    },
    {
      "title": "Buy and hold stocks!",
      "text": "A lot of unnecessary information. It all boils down to “Buy and hold stocks”",
      "rating": 3.0,
      "verified": true,
      "author": "Brandon Pretzel",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "This book is an excellent primer for those interested in learning about investment",
      "text": "This book is an excellent primer for those interested in learning about investment. It's a permanent addition to my financial Library.",
      "rating": 5.0,
      "verified": true,
      "author": "JOHN R. SLUGA",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Gives a wide variety of information for the user to ...",
      "text": "Gives a wide variety of information for the user to do with as they please. Lots of charts and some math (if you can't follow it, the main points are still outlined in English). It is not an \"invest in this and get rich book\". I am still reading, but it's exactly what I was hoping for. \"If You Think Education Is Expensive, Try Ignorance\".",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170212
    },
    {
      "title": "A Very Good Read",
      "text": "I like this book which is quite different from books of this kind because of the writing style.",
      "rating": 5.0,
      "verified": true,
      "author": "Montague Burton",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "How to avoid the pitfalls Wall Street has dug to entrap you and your savings.",
      "text": "Has some great insights on the myriad schemes Wall Street has cooked up to legally and illegally bilk you of your savings.More important tells you how to avoid them.",
      "rating": 5.0,
      "verified": true,
      "author": "Colin Warwick",
      "helpful_votes": 0,
      "publication_date": 20160816
    },
    {
      "title": "It's a great book. If you don't have a lot of ...",
      "text": "It's a great book. If you don't have a lot of knowledge of markets this book will give you a good broad understanding. I would by no means limit your reading to just this book. But If you just want a good working knowledge and don't really like investing or finance this is the book to read.",
      "rating": 4.0,
      "verified": true,
      "author": "TK",
      "helpful_votes": 2,
      "publication_date": 20160714
    },
    {
      "title": "Great book for those looking to invest on their own",
      "text": "Great book for those looking to invest on their own. You don't need to pay a professional 1-2% of everything you have every year and not beat the market.",
      "rating": 5.0,
      "verified": true,
      "author": "WtrBby",
      "helpful_votes": 0,
      "publication_date": 20170206
    },
    {
      "title": "Very good book. I dont follow every single thing in ...",
      "text": "Very good book. I dont follow every single thing in it, but there is great history and great lessons in here.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "Great for long term investors",
      "text": "This is truly the only book you need to get on long term investing. Great information for anyone interested in investing in the market. Tells you exactly what to invest in based on your age with an excellent description as to why.",
      "rating": 5.0,
      "verified": true,
      "author": "Landon Shultz",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Read this only if you want to make money...",
      "text": "My investment Bible. I've used this ever since having it as a textbook in my MBA program. Clear explanations with no BS, and gives fair time to other investing methods.",
      "rating": 5.0,
      "verified": true,
      "author": "strider97116",
      "helpful_votes": 0,
      "publication_date": 20160109
    },
    {
      "title": "Awesome buy",
      "text": "Learned a lot great tips and help me build my profile in stock market.",
      "rating": 5.0,
      "verified": true,
      "author": "David Amin",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Five Stars",
      "text": "This man explains this confusing world of Wall Street so everyone else can understand. It's GREAT",
      "rating": 5.0,
      "verified": true,
      "author": "Dane",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Good book.",
      "text": "HIlarious, entertaining, and educational. Some examples I wouldn't want my kid to read, but overall very informative.",
      "rating": 4.0,
      "verified": true,
      "author": "Moshe Berman",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Could be more concise",
      "text": "I bought this book in order to understand more about the stock market and start learning how to invest/trade. I think that while this book does simplify it a lot, it does seem a little bit long for a book on this topic for beginners. I think it could be a little bit more concise.",
      "rating": 4.0,
      "verified": true,
      "author": "Marvin Rasche",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "A timeless classic",
      "text": "Love the continuous update of the book, I've bought three editions already since 2007.",
      "rating": 5.0,
      "verified": true,
      "author": "Lord Dima",
      "helpful_votes": 0,
      "publication_date": 20170708
    },
    {
      "title": "Gold Standard for Investing",
      "text": "Perfect for young investors looking for beginner's knowledge in the stock market! But perhaps most importantly Dr. Malkiel emphasizes the importance of endurance in long-term investing and how to do it wisely. Any age group or income level will benefit from this book.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelsey Steffen",
      "helpful_votes": 4,
      "publication_date": 20150128
    },
    {
      "title": "Five Stars",
      "text": "One of the best books I have read. A little slow in some places but overall very insightful.",
      "rating": 5.0,
      "verified": true,
      "author": "BBQ514",
      "helpful_votes": 0,
      "publication_date": 20170601
    },
    {
      "title": "Great big-picture view of the ups and downs of the ...",
      "text": "Great big-picture view of the ups and downs of the stock market with good supporting data. A must read classic for any investor.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "Now I'm Smarter",
      "text": "Great book for the beginner investor or the investor nearing retirement. Concepts are communicated in an understandable manner. This book holds your attention from beginning to end. I'm a moderately informed investor, with respect to investment knowledge and skills, and this books definitely has moved me up the learning curve. Definitely worth the read. Material is updated through 2014 and the material in this most recent edition of the book first authored in 1973 is as relevant as ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike H. II",
      "helpful_votes": 3,
      "publication_date": 20170312
    },
    {
      "title": "Baseline Equities Knowledge",
      "text": "Solid Book for the Beginning Investor. Gives you a solid baseline and historical perspective. Must have in your library if your an investor in equities.",
      "rating": 5.0,
      "verified": true,
      "author": "Cameron Rankin",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Get comfortable, and prepare to have your brain worked out ...",
      "text": "Little more advanced than what was recomended to me. Get comfortable, and prepare to have your brain worked out with sound advice.",
      "rating": 4.0,
      "verified": true,
      "author": "Sparky",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "A must-read. In fact, read every edition when it comes out...",
      "text": "One of the best investing books ever written! It covers all the essentials including: a brief history of the markets, stocks vs bonds, technical vs fundamental analysis, risk vs reward, modern portfolio theory and behavioral finance.",
      "rating": 5.0,
      "verified": true,
      "author": "XNC",
      "helpful_votes": 0,
      "publication_date": 20160105
    },
    {
      "title": "Wish I would have read this when I was in my early 20's!",
      "text": "This is the best investing book you will ever read - I wish I would have read this about 15 years earlier!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170425
    },
    {
      "title": "I totally enjoyed it.",
      "text": "scholarly work that delves deep into history and current thought on investing. I totally enjoyed it.",
      "rating": 5.0,
      "verified": true,
      "author": "losira",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Nice",
      "text": "good Book, if you are a high school student I would not recommend it unless you have previous knowledge",
      "rating": 4.0,
      "verified": true,
      "author": "Manuel forero",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Everyone should read this book.",
      "text": "Very informative and a book any and every investor should read (especially the younger investor). Simplifies the seemingly complex endeavor of picking stocks and makes investing accessible to even the most casual investor. I would recommend to every one I know. I will not summarize any of his points here... Go buy the book!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "Five Stars",
      "text": "I purchased the book because the index legend recomended it on a vanguard confrence call. Research Jack Bogle.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel M.",
      "helpful_votes": 0,
      "publication_date": 20160801
    },
    {
      "title": "Easy to understand",
      "text": "I enjoyed this book as a beginner investor. There were some parts that delved deeper than my interest but it spoke to a broad range of questions I had.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Bilodeau",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "A must for individual investors!",
      "text": "Awesome and practical guide to individual investing. Cuts through the \"bull\" that is often presented to the investor.",
      "rating": 5.0,
      "verified": true,
      "author": "Ugo Chiulli",
      "helpful_votes": 0,
      "publication_date": 20160819
    },
    {
      "title": "Provides clear easy to understand advise regarding investing",
      "text": "Very helpful book. Provides clear easy to understand advise regarding investing. Manages to provide interesting approach to covering topics that are often rather dry in other investment books.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory S.",
      "helpful_votes": 0,
      "publication_date": 20150717
    },
    {
      "title": "... lives up to its reputation of one of the best investment books ever written",
      "text": "This book lives up to its reputation of one of the best investment books ever written.",
      "rating": 5.0,
      "verified": true,
      "author": "tgh",
      "helpful_votes": 0,
      "publication_date": 20161209
    },
    {
      "title": "Great book!",
      "text": "I was required to read this book for my MBA investments course and I really enjoyed it. This book is full of great stories about investing and does a good job of describing the different methods of investing. I would recommend any finance people read this book.",
      "rating": 5.0,
      "verified": true,
      "author": "Clint Landers",
      "helpful_votes": 0,
      "publication_date": 20151208
    },
    {
      "title": "Best Stock Book on the Planet",
      "text": "The Best book on the market ever. Everyone will benefit from this book, but the more the reader understands statistical studies, the greater the impact on his or her trading.",
      "rating": 5.0,
      "verified": true,
      "author": "Wayne R. Lovern",
      "helpful_votes": 0,
      "publication_date": 20150224
    },
    {
      "title": "Excellent read!",
      "text": "This version is without a doubt an investors classic. I still have my hard copy from 1990 and was ecstatic to find this updated version. A must read for every investor.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Batten",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Do not trust any one with your money",
      "text": "To understand how Wall str. works ,it makes much easier to see thus the foc",
      "rating": 5.0,
      "verified": true,
      "author": "pkary",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "must read!!!!!!!!!!",
      "text": "A must read for all ages. Don't wait!!!! I waited until I was 80 which was a real mistake. Do it.",
      "rating": 5.0,
      "verified": true,
      "author": "JOY",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "Pure Gold*",
      "text": "* as far as the saying goes, not the commodity enjoyable read, priceless contents. Although not mentioned in the book, investing the money and time to read this book is the single best investment move you are gonna make.",
      "rating": 5.0,
      "verified": true,
      "author": "Ice Penov",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Five Stars",
      "text": "Wish I had read this book ten years ago or sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Louis A. Carlone",
      "helpful_votes": 0,
      "publication_date": 20170618
    },
    {
      "title": "Poor print quality",
      "text": "A must-read book of all time. This book deserves better printing quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Tao Xu",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "This is the most important book you will ever read in your life.",
      "text": "Forget Morning Star, forget Barron's, forget WSJ, forget Bloomberg, forget the Goldman Sachs analyst report, forget scores of books on investment, or trading, forget your son-in-law suggestion to buy a hot stock, forget your father-in-law suggestion about dividend paying stock. Read this first and digest it well, then proceed slowly and thoughtfully while reminding yourself \"You are only a mortal, your mind sees what is easier to see, you will make mistakes, try to make only very small mistakes\".",
      "rating": 5.0,
      "verified": true,
      "author": "Andro Giorgadze",
      "helpful_votes": 2,
      "publication_date": 20161220
    },
    {
      "title": "A very good approach to investing is presented",
      "text": "A very good approach to investing is presented. Everything is backed up with statistics and makes sense. All who invest on their own authority should read this book.",
      "rating": 5.0,
      "verified": true,
      "author": "The Humble American",
      "helpful_votes": 0,
      "publication_date": 20170823
    },
    {
      "title": "Long book - hard to read - towards the end ...",
      "text": "Long book - hard to read - towards the end though you see clearly the path to real wealth.",
      "rating": 4.0,
      "verified": true,
      "author": "Matt Pray",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Great book. I checked out an older edition of ...",
      "text": "Great book. I checked out an older edition of this book from my local library. I read it cover to cover, over and over again. I had to have my own copy. Its a must read!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Sanders",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Great Read",
      "text": "For anyone who already has a basic understanding of Wall Street, this book is a must read.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Great Investing Book",
      "text": "Great book. Very informative and easy to read. A must to learn the foundations of investing, but take notice, while it’s written fr the beginner, it’s still quite technical.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Five Stars",
      "text": "The book is a classic. Everyone owes it to themselves to read it.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Margulies",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Great foundational book for retirement planning.",
      "text": "Very good conservatively common-sense overview of personal investing and how to make long-term decisions that don't require a ton of intellectual attention and upkeep.",
      "rating": 5.0,
      "verified": true,
      "author": "bangwilson",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "Fun read for everyone interested in the market",
      "text": "Great, simple-to-follow overview of the efficient market hypothesis. Fun read for the enthusiast, professional, and everyone in between. Highly recommended read if you are new to investing.",
      "rating": 5.0,
      "verified": true,
      "author": "Drew French",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "Five Stars",
      "text": "Essential for anyone looking to invest or in need of information regarding market dynamics.",
      "rating": 5.0,
      "verified": true,
      "author": "Hitch83",
      "helpful_votes": 0,
      "publication_date": 20151025
    },
    {
      "title": "The rest revolves around that and gives you a lot of amazing information. Mutual funds are not as safe as ...",
      "text": "Probably the most important book on finance you'll ever read if your talking in terms of investing. Buy an S&P 500 index fund. Boom. That's the basis of the book. The rest revolves around that and gives you a lot of amazing information. Mutual funds are not as safe as tou think they are!",
      "rating": 5.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 5,
      "publication_date": 20160822
    },
    {
      "title": "All your investment questions answered",
      "text": "Best book on investing i've ever read. I feel richer allready.",
      "rating": 5.0,
      "verified": true,
      "author": "sharpener",
      "helpful_votes": 0,
      "publication_date": 20170903
    },
    {
      "title": "Read it years ago and thought it great. Reread recently and still think its great",
      "text": "Read it years ago and thought it great. Reread recently and still think its great. Haven't followed it to the letter however but in old age it looks like the way to go now.",
      "rating": 5.0,
      "verified": true,
      "author": "harvey l saylor",
      "helpful_votes": 0,
      "publication_date": 20160330
    },
    {
      "title": "Five Stars",
      "text": "A must read before you begin investing in the market.",
      "rating": 5.0,
      "verified": true,
      "author": "Ricardo P.",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "All Time Classic",
      "text": "an ALL Time Classic. Recently Updated. Should be on Every Investor's Must List",
      "rating": 5.0,
      "verified": true,
      "author": "Seismic-Lew",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "The starting point for any aspiring investor",
      "text": "Simple and truthful. This book simply states the obvious and tells anyone willing to listen that within a reasonable time you can become financially free.",
      "rating": 5.0,
      "verified": true,
      "author": "Gunnar Schlinke",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Yes",
      "text": "Great book and great delivery. Y’all are speed demons. Fast and furious.",
      "rating": 5.0,
      "verified": true,
      "author": "Luke",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Very informative",
      "text": "Great read that was written by a very smart guy.",
      "rating": 4.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Great study",
      "text": "Current update is most relevant to understanding the power of concentrating investing using index funds and ignoring smoke and mirrors of slick talking sharks.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170507
    },
    {
      "title": "Great concepts but a little bit redundant",
      "text": "The ideas and concepts expressed on this book can really help a novice investor avoid making noob mistakes. It is a little bit redundant but it is definitely worth a read",
      "rating": 4.0,
      "verified": true,
      "author": "fedecasas",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "If you can't beat 'em, join 'em!...the market that is.",
      "text": "Bought it for the relative who thinks they have a \"system\" to beat the market...also bought a copy for myself as a refresher.",
      "rating": 4.0,
      "verified": true,
      "author": "Kent H.",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "A thorough guide to index funds",
      "text": "This is an accessible discussion of most investing principles that someone who manages his or her own investments should know. It pretty heavily promotes index funds - and makes on apologies for doing so. The case he makes for them is convincing.",
      "rating": 5.0,
      "verified": true,
      "author": "Neil Nelsen",
      "helpful_votes": 0,
      "publication_date": 20160813
    },
    {
      "title": "Missing 32 pages",
      "text": "Where are the first 32 pages? The book starts on page 33.",
      "rating": 1.0,
      "verified": true,
      "author": "Kamran Abdullayev",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Must Read",
      "text": "Essential reading. This book taught me so much about investing and economics.",
      "rating": 5.0,
      "verified": true,
      "author": "S L",
      "helpful_votes": 0,
      "publication_date": 20170206
    },
    {
      "title": "This book has been around for a long time. ...",
      "text": "This book has been around for a long time. It contains solid , basic down to Earth advice for investors at all skill levels. I will definitely require my daughter to read. Sound advice on building a solid retirement platform no matter what your age.",
      "rating": 4.0,
      "verified": true,
      "author": "Dennis Leet",
      "helpful_votes": 0,
      "publication_date": 20150827
    },
    {
      "title": "great finance and investing bible .",
      "text": "This book is very comprehensive and covers all aspects of investing . It provides ton of great information on how the world of finance operates and how a retail investor can benefit by taking a long term view . The main gist revolves around buying low cost index fund and take the lifecycle approach to investing based on age and risk appetite . It also has good humor sprinkled around to make the text overall engaging . Also it is a big book and may take some time to finish. Overall if you are interested in world of investing and finance this is the best book out there .",
      "rating": 5.0,
      "verified": true,
      "author": "Mehul S.",
      "helpful_votes": 17,
      "publication_date": 20150104
    },
    {
      "title": "A good first book to read about how Wall Street really ...",
      "text": "Extremely readable. Very knowledgeable. A good first book to read about how Wall Street really works and how stocks really perform.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Hicks",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "Item as described",
      "text": "Excellent book, It was what I was expecting. Item as described. Thanks",
      "rating": 4.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Great first step to investing.",
      "text": "Author gives you common sense tips that are easily forgotten as well as covers all the topics with enough examples. Highly recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Mihir Sanghavi",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "GREAT Book, a MUST read.",
      "text": "GREAT Book!! Now I'll pass it on to my daughter and some friends. Eventually I'll get it back and read it again in a few years.",
      "rating": 5.0,
      "verified": true,
      "author": "USNeodCMC",
      "helpful_votes": 0,
      "publication_date": 20171013
    },
    {
      "title": "Well written and very useful. Could have been a bit more concise hence ...",
      "text": "Well written and very useful. Could have been a bit more concise hence the 4 stars. Malkiel lays out a compelling case for his views and provides loads of useful information.",
      "rating": 4.0,
      "verified": true,
      "author": "Mkauz",
      "helpful_votes": 0,
      "publication_date": 20150409
    },
    {
      "title": "A good read!",
      "text": "This book reviews the basic tenets of investing with the inevitable associated risks. For those who make their own investing decisions, this book should help improve the investment results.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Daugavietis",
      "helpful_votes": 0,
      "publication_date": 20161106
    },
    {
      "title": "the cost of your human capital might be better spent learning a much more illiquid market",
      "text": "An absolutely essential read for investors. In a day of capital gains taxes and high management fees, the odds of beating the market are close to insurmountable. Going over the basics of your investment turnover and the long term tax effect on your portfolio returns is critical to investing, and retiring, with enough in the bank! While patience and low book value, small stocks are likely to outperform, the cost of your human capital might be better spent learning a much more illiquid market. Malkiel makes the strongest argument yet for passive index investing. Before you allow that extra % point to go to your mutual fund manager, ask yourself, \"Am I getting enough bang for my buck?\"",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20161028
    },
    {
      "title": "This is the perfect book for millennials",
      "text": "Follow the advise Burton G. Malkiel gives and you'll be set for life. This is the perfect book for millennials.",
      "rating": 4.0,
      "verified": true,
      "author": "David M.",
      "helpful_votes": 0,
      "publication_date": 20150713
    },
    {
      "title": "Five Stars",
      "text": "The book is very concise and does a great job of delivering its message.",
      "rating": 5.0,
      "verified": true,
      "author": "GateDancer",
      "helpful_votes": 0,
      "publication_date": 20150510
    },
    {
      "title": "One of my favorite books.",
      "text": "One of my favorite books. Every point is backed up with stats upon stats upon stats.",
      "rating": 5.0,
      "verified": true,
      "author": "RD",
      "helpful_votes": 0,
      "publication_date": 20160313
    },
    {
      "title": "Good Stuff!",
      "text": "Excellent basic overview of investment theory and uncommon sense advice.",
      "rating": 5.0,
      "verified": true,
      "author": "JanMc",
      "helpful_votes": 0,
      "publication_date": 20150813
    },
    {
      "title": "Five Stars",
      "text": "The best book in it's class. The original source of basic ideas on personal investing - the classic.",
      "rating": 5.0,
      "verified": true,
      "author": "Dejan Zecevic",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Five Stars",
      "text": "Excellent and well written discussion of efficient markets and random walk down wall street",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Bienstock",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Five Stars",
      "text": "A bible for those of us who don't want to spend a lot of time and effort to invest.",
      "rating": 5.0,
      "verified": true,
      "author": "John R",
      "helpful_votes": 0,
      "publication_date": 20160421
    },
    {
      "title": "Awesome thus far",
      "text": "Awesome thus far... ive actually been incorporating a lot of the information that I've read, into my everyday conversations in my business and personal life. Awesome & very 'black & white', no unnecessary complexities.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris b",
      "helpful_votes": 0,
      "publication_date": 20160526
    },
    {
      "title": "I can see why so many praise this book",
      "text": "A very insightful book cover with so many topics for a person who chooses to take upon the management of his/ her financial/ investments in the jungle known as Wall Street. I will reference this and other books as I move forward into retirement. Very deep and informative. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian C Darr",
      "helpful_votes": 2,
      "publication_date": 20160618
    },
    {
      "title": "The Case for Investing in Index Funds",
      "text": "Provides an excellent case for the wisdom of investing in a balanced portfolio of index funds.",
      "rating": 5.0,
      "verified": true,
      "author": "John B. Phelps",
      "helpful_votes": 0,
      "publication_date": 20160625
    },
    {
      "title": "Five Stars",
      "text": "The greatest way to loose all illusions about getting rich in no time.",
      "rating": 5.0,
      "verified": true,
      "author": "Ivan Boyko",
      "helpful_votes": 0,
      "publication_date": 20160618
    },
    {
      "title": "Five Stars",
      "text": "Excellent read. Best book on investing for all level of investors!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Abram Keith Graham",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Five Stars",
      "text": "It's the fifth edition I have purchased. A classic and a must have reference book.",
      "rating": 5.0,
      "verified": true,
      "author": "Blaine Carter",
      "helpful_votes": 0,
      "publication_date": 20170806
    },
    {
      "title": "Easy to read review of how the financial investment world ...",
      "text": "Easy to read review of how the financial investment world works. Up to date through 2015, with the latest investment options covered.",
      "rating": 4.0,
      "verified": true,
      "author": "Charles Denight",
      "helpful_votes": 0,
      "publication_date": 20160810
    },
    {
      "title": "A Classic",
      "text": "A classic of investment advice; clear explanations of how things work and why index funds should be the basis of everyone's investment portfolio.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150310
    },
    {
      "title": "Five Stars",
      "text": "Excellent book full of good advice. It is a classic investing book.",
      "rating": 5.0,
      "verified": true,
      "author": "ILIAS MAMALIS",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "A good long term view of markets and the factors that ...",
      "text": "A good long term view of markets and the factors that effect them both reasonable and unreasonable ones. Concludes with a well-reasoned investment plan for individuals in different financial circumstances. Recommendation of the use of index funds as core investments and far most people is excellent advice.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward V. Trahan Jr.",
      "helpful_votes": 0,
      "publication_date": 20150905
    },
    {
      "title": "Makiel makes some great arguments against that thinking",
      "text": "I'm sure there are still many people out there who think they can game the system, but Dr. Makiel makes some great arguments against that thinking. I'd already made my decision to take the route he recommends, and this just confirms my decision. Yes, you can get rich by picking a stock that takes off, but the odds are far better if you take the value approach and stick to the plan.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 0,
      "publication_date": 20150925
    },
    {
      "title": "The One Book to Read on Investing",
      "text": "This is simply the best book on investing and I think I've read them all.",
      "rating": 5.0,
      "verified": true,
      "author": "Bigwallbob",
      "helpful_votes": 0,
      "publication_date": 20150416
    },
    {
      "title": "Five Stars",
      "text": "Great Book! I should have read it when it first came out.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruddah",
      "helpful_votes": 0,
      "publication_date": 20150806
    },
    {
      "title": "Excellent book",
      "text": "Excellent book that is still accurate on how Wall Street really works.",
      "rating": 5.0,
      "verified": true,
      "author": "DrDMD",
      "helpful_votes": 0,
      "publication_date": 20150215
    },
    {
      "title": "Great overview for a beginner",
      "text": "Very informative and easy to understand as a complete rookie to the dealings of Wall Street",
      "rating": 5.0,
      "verified": true,
      "author": "Cory Lee",
      "helpful_votes": 0,
      "publication_date": 20150326
    },
    {
      "title": "This is one of the two best. Awesome book",
      "text": "Have read over 10 investment books. This is one of the two best. Awesome book.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Hood",
      "helpful_votes": 0,
      "publication_date": 20150618
    },
    {
      "title": "excellent read",
      "text": "Great new edition. Worth reading even if you read last edition. Only criticism is idea of using dividend paying stocks as \"bond equivalents.\" Should just admit new portfolio recommendation is higher stock allocation than in the past.",
      "rating": 5.0,
      "verified": true,
      "author": "MK",
      "helpful_votes": 0,
      "publication_date": 20150123
    },
    {
      "title": "Five Stars",
      "text": "Absolutely a great book and a 'must read'. Very introductory and easy to read",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160127
    },
    {
      "title": "Five Stars",
      "text": "Great Book! So informative and it made me think of pasilsive income in a new light.",
      "rating": 5.0,
      "verified": true,
      "author": "EO",
      "helpful_votes": 0,
      "publication_date": 20150802
    },
    {
      "title": "Reasonable perspective",
      "text": "Good perspective. Also a must: Swedroe and Bernstein. Get them. Then get online to the \"Bogleheads forum\". A must for personal investment finance for retirees and those working toward a healthy retirement.",
      "rating": 3.0,
      "verified": true,
      "author": "Unanimouse",
      "helpful_votes": 0,
      "publication_date": 20170331
    },
    {
      "title": "This is a classic that never gets old. if ...",
      "text": "This is a classic that never gets old. if you are going to read one book on investing that can be understood by non-experts, this is the one. I pass these out as gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond E. Pinard",
      "helpful_votes": 0,
      "publication_date": 20160305
    },
    {
      "title": "Five Stars",
      "text": "Succinct & holistic. Cradle to grave investment education & advice.",
      "rating": 5.0,
      "verified": true,
      "author": "DD",
      "helpful_votes": 0,
      "publication_date": 20150226
    },
    {
      "title": "I was paying those damn predatory advisors around 12-20k annually to do nothing but send me reports and pretend like they work",
      "text": "I'm a millionaire. I was paying those damn predatory advisors around 12-20k annually to do nothing but send me reports and pretend like they work. Nothing that I couldn't' do myself. Take control of your financial future. I recommend this book.",
      "rating": 4.0,
      "verified": true,
      "author": "Grumpy Howard",
      "helpful_votes": 0,
      "publication_date": 20170624
    },
    {
      "title": "The Truth about the Stock Market",
      "text": "This book confirms, with candid expertise, what I have have been suspecting about the 'market'! The author clearly lays out the dangers of trying to 'beat the market' but also gives strategies for wise, long-term investing.",
      "rating": 5.0,
      "verified": true,
      "author": "David Phelps",
      "helpful_votes": 3,
      "publication_date": 20150215
    },
    {
      "title": "Four Stars",
      "text": "It's a pretty good book. I've learned a lot about what I \"didn't know\". Very thorough & educational.",
      "rating": 4.0,
      "verified": true,
      "author": "Just Rob",
      "helpful_votes": 2,
      "publication_date": 20160520
    },
    {
      "title": "Required Investment Reading",
      "text": "This book is chock full of solid investment advice. It should be required reading for anyone thinking of investing in stocks and bonds.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert W. Catlin Jr.",
      "helpful_votes": 0,
      "publication_date": 20160913
    },
    {
      "title": "Great book for all investors",
      "text": "Great overall advice! There are so many jokes in there that makes it easy to read. I love this book. This was my first book that I read from the first to the last page. So, thank you for a great book.",
      "rating": 5.0,
      "verified": true,
      "author": "SK",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "Great book for beginners and veterans alike!",
      "text": "Very well written and easy to understand. This book is essential if you want to invest, whether in mutual funds or day trading.",
      "rating": 5.0,
      "verified": true,
      "author": "Sb1three",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "(new edition) an excellent guide to investing and a sharp destruction of alleged ...",
      "text": "As usual, (new edition) an excellent guide to investing and a sharp destruction of alleged schemes to make money.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Bechtel",
      "helpful_votes": 0,
      "publication_date": 20170815
    },
    {
      "title": "Great book!",
      "text": "That's a great book. The book is easy to read and full of examples about financial markets and how they work. It states a point, right at the start, and shows why this point stands up. It makes clear for everybody how and why stock professionals act and how you should act to make some money investing in stocks even if you are not a professional.",
      "rating": 5.0,
      "verified": true,
      "author": "Andre Luis Leite",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "which was nice.",
      "text": "The TLDR is that passive investors should buy passively managed index funds. The author goes into debunking many other key ratios and metrics that various so-called financial experts have used in the past, which was nice.",
      "rating": 3.0,
      "verified": true,
      "author": "xlittlebirdyx",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "A must-read!",
      "text": "One of the most important books ever written on investing - and I'm in the business.",
      "rating": 5.0,
      "verified": true,
      "author": "Uncle John",
      "helpful_votes": 0,
      "publication_date": 20161222
    },
    {
      "title": "Five Stars",
      "text": "Great advice for those looking for a hands off strategy for saving for retirement",
      "rating": 5.0,
      "verified": true,
      "author": "D Nelson",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "Five Stars",
      "text": "terrific book discussing how and what you should invest in. timeless classic",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20161016
    },
    {
      "title": "Cuts through the confusion.",
      "text": "Insightful, down to earth but sufficiently detailed analysis of how to see the trees and not the forest. I've been in the business for eight years.",
      "rating": 5.0,
      "verified": true,
      "author": "Walter R Johnson",
      "helpful_votes": 0,
      "publication_date": 20160903
    },
    {
      "title": "Excellent book for investors at any level.",
      "text": "This is an excellent book for investors at any level. Or anybody just interested in investing in general. It goes in great detail about every theory that has existed and exists, from both a practical and theoretical perspective. I found his writing to be clear and concise, and it's also clear that he has a great understanding about the subject. I won't go into much detail about the recommendations, to not spoil the book. But, if you're interested in learning about investing in the stock market. I would definitely give this book a try. It will give you a great understanding about the market.",
      "rating": 5.0,
      "verified": true,
      "author": "Elfrank",
      "helpful_votes": 0,
      "publication_date": 20161025
    },
    {
      "title": "An Excellent Book.",
      "text": "I purchased this book, as it was needed for a course for my Master's program; it wasn't a required book, but decided to purchase it anyway. I read the entire book cover-to-cover over the course of a weekend and it was a quick and easy read. The content wasn't dry, difficult to understand, or boring; it felt like a story (which is something I personally enjoyed) and was well written. I would recommend purchasing this book regardless of whether or not you need the book (for a course, for life, for fun). The book came packaged well and the the book in brand-new excellent quality! Definitely worth the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Mikolaj S.",
      "helpful_votes": 3,
      "publication_date": 20161108
    },
    {
      "title": "Great book. Much of it confirmed what I already ...",
      "text": "Great book. Much of it confirmed what I already knew but if you are an investing novice you will get a lot out of this book. It presents difficult material in an understandable way.",
      "rating": 5.0,
      "verified": true,
      "author": "PChrisco",
      "helpful_votes": 0,
      "publication_date": 20160911
    },
    {
      "title": "Four Stars",
      "text": "About as much fun as a book on finance can be,",
      "rating": 4.0,
      "verified": true,
      "author": "S. A. Joyce",
      "helpful_votes": 0,
      "publication_date": 20150315
    },
    {
      "title": "Amazing",
      "text": "This book is an incredible wealth of knowledge for the average person to soak in. It breaks down often complex financial jargon into layman's terms. If you want to become a savvy investor and don't know where to start, I strongly recommend this book.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20161013
    },
    {
      "title": "Excellent material and presentation",
      "text": "Very entertaining . Excellent material and presentation . A great read.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy McLean",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "Five Stars",
      "text": "Great book. One of the best ever written on investing.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph L. Tillman",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Great Read!",
      "text": "If you are thinking of investing, read this book asap. It covers a lot of basics and general understanding of the market. Now, he does push his opinion/advice but keep reading because he reasons them quite nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Maksym",
      "helpful_votes": 0,
      "publication_date": 20160623
    },
    {
      "title": "Great financial read in plain language",
      "text": "A great book for the average person trying to understand how the market works. A very practical book with info to start a portfolio.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161129
    },
    {
      "title": "Read it early in investing life",
      "text": "Wish I had read it 20 years ago. At least my retirement account wished I had.",
      "rating": 5.0,
      "verified": true,
      "author": "CD",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Five Stars",
      "text": "Greatest stock investment book of all time. My 5th edition of this book. Made me a millionaire.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Baker",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "Good book, not sure if amazon packaging dirtied book",
      "text": "I've read the book before buying and its great. I decided to get a copy as a gift for a friend, however the book shipped to me was very dirty and the cover was wrinkled. I'm going to try to use a magic eraser to at least get the black smudges off the front as there isn't time for a replacement.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151218
    },
    {
      "title": "Good reading",
      "text": "So far found quite informative and ease to follow. Nice book to read who like to invest in stock market",
      "rating": 3.0,
      "verified": true,
      "author": "Sanjay",
      "helpful_votes": 0,
      "publication_date": 20170101
    },
    {
      "title": "YOU CAN'T BEAT THE MARKET!!!",
      "text": "Very informative and easy to understand for the most part. Overall well worth the time spent reading",
      "rating": 5.0,
      "verified": true,
      "author": "RebC",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "I did not enjoy this book",
      "text": "I did not enjoy this book. I was looking for a primer on finance, since I am new to the field, but found this read to be a snore.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170315
    },
    {
      "title": "Has been of no help After reading half book Pretty much worthless",
      "text": "Do not get this book Very out dated info . Has been of no help After reading half book Pretty much worthless",
      "rating": 1.0,
      "verified": true,
      "author": "maggie",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "Great book",
      "text": "Best book for someone who wants a general understanding of investing",
      "rating": 5.0,
      "verified": true,
      "author": "Westyn bodell",
      "helpful_votes": 0,
      "publication_date": 20190220
    }
  ],
  "product_meta": {
    "title": "A Random Walk down Wall Street: The Time-tested Strategy for Successful Investing",
    "rating": 4.6,
    "specifications": {
      "Paperback": "496 pages",
      "ISBN-10": "9780393352245",
      "ISBN-13": "978-0393352245",
      "Item Weight": "12.9 ounces",
      "Product Dimensions": "5.5 x 1.2 x 8.3 inches",
      "Publisher": "W. W. Norton & Company; Eleventh Edition (January 4, 2016)",
      "Language:": "English",
      "ASIN": "0393352242",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Books",
      "Business & Money",
      "Investing"
    ],
    "price": 23.94
  }
}