{
  "website_summaries": [
    {
      "verdict": "A very nice bound-leather field guide that is useful for reference of anyone interested in insects.",
      "pros": [
        "Lots of good information in this book",
        "Durable cover",
        "Subjects photographed in their habitats",
        "Helps aid with identification",
        "Beautiful pictures",
        "Children interested in spiders and insects will really enjoy this book"
      ],
      "cons": [
        "This book seems to not have as many insects featured as some others",
        "It can be a little difficult to use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "If you want details, order an insect book specific to where you live....",
      "text": "There are many many insects out there; it is unlikely that any one book covers them all. I ordered this book without thinking about the fact that the insect population in \"North America\" and the insect population in New England (where I live) might be very different. I now have a very nice book that contains only two sentences about the Eastern Carpenter Bee and nothing specific about winter moths, both of which are prevalent in New England. I have now ordered another book that claims to be specific to New England. Caveat emptor....",
      "rating": 3.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 16,
      "publication_date": 20180630
    },
    {
      "title": "I'm in love with these books",
      "text": "I'm in love with these books. We educate our children and use an older method called Charlotte Mason. For identification, these are some of the best tools to have. Now, they could be 'smaller' but then you'd lose the fantastic pages in the middle w/ photos!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Templin",
      "helpful_votes": 12,
      "publication_date": 20171112
    },
    {
      "title": "Good basic book, missing many species though.",
      "text": "I like this book a lot, I do find that it is lacking so many insects that it isn't all that useful though. I realize there are so many it would be hard to document them all, but the book fell short of my expectations.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 6,
      "publication_date": 20180605
    },
    {
      "title": "Great field guide for insects/spiders",
      "text": "Husband is a cellular biologist and biotechnologist so he loves the National Audubon Society field guides. My 10 year old son requested this guide to be added to our collection because he is very interested in insects. He has referred to this book multiple times already and identified several insects in the backyard and surrounding woods. Even if you are not trying to identify a particular insect or spider it's fun to just pick this up and read off and on. Of course it cannot include ALL insects and spiders but the \"main\" ones are here. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Harbin",
      "helpful_votes": 13,
      "publication_date": 20160401
    },
    {
      "title": "Very useful book in the field or at home",
      "text": "This has been extremely helpful for identifying the insects encountered. I enjoy photography, and taking a photo of an interesting insect is fun, but I really like knowing what it is that I found. This has in almost every instance resulted in finding the desired identity.I don't carry it with me, but it looks durable enough to be put in my camera bag and have it survive a lot of handling. This past summer I was fortunate to encounter a brood of Periodical Cicadas. The book clearly shows them and explains the 13 - 17 year appearance. The book did not mention the commonly heard name of Red Eyed Cicada. Perhaps that common name is only a regional thing.",
      "rating": 5.0,
      "verified": true,
      "author": "PhotoHome1",
      "helpful_votes": 2,
      "publication_date": 20151205
    },
    {
      "title": "Could be better.",
      "text": "This book has a ton of stuff in it and lots of pics. But my kids and I have a hard time finding most bugs. I wish they had the male and female pics of each bug as well as any other variations. The kids get so excited when they find a bug but its disappointing when we try to look it up. We end up googling it and figure out what they are that way. I wish the pictures said if it was poisonous or if it would bite, rather than having to read in the back. Even then when you read about the bug sometimes it doesn't say. It should say either way.",
      "rating": 3.0,
      "verified": true,
      "author": "Lana",
      "helpful_votes": 5,
      "publication_date": 20150124
    },
    {
      "title": "Sad presentation.",
      "text": "This was a gift for my 6 year old who is newly quizzical about insects. Cover was torn and unpresentable as a gift, even to a 6 year old. I wanted him to build a library of books and for this to be a legacy gift as the first in a collection.",
      "rating": 1.0,
      "verified": true,
      "author": "jc",
      "helpful_votes": 3,
      "publication_date": 20180311
    },
    {
      "title": "Great book to add to our collection!",
      "text": "Book is exactly as expected, brand new, and a great addition to our collection. My ONLY reason for not giving this 5 stars is that the book came in a HUGE oversized padded envelope with no wrapping or protection. The book was a little warped based on shipping packaging. Thankfully I can fix the issue by keeping it flat for a few days...",
      "rating": 4.0,
      "verified": true,
      "author": "ALE",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "I was disappointed to find too that it only highlighted the most ...",
      "text": "A guide to insects and spiders of North America would have to be very large, and this guide is not. I was disappointed to find too that it only highlighted the most interesting-looking species and the most well-known, i felt that easily recognizable species were unnecessary to display because I needed to identify a little brown spider, and could not. I will keep it as a fun book for my young daughter, but as far as a guide, it's not much of one.",
      "rating": 2.0,
      "verified": true,
      "author": "Gabrielle",
      "helpful_votes": 6,
      "publication_date": 20141217
    },
    {
      "title": "A nice surprise for my husband",
      "text": "A nice surprise for my husband. I shared my old one with another bug lover. Easy to use. There are so many insects that are included in this book. No all of course. Beautiful photos and wonderful descriptions.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl K. Steuerwald",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "I love that all the pictures are grouped in the middle ...",
      "text": "Classic field guide. I love that all the pictures are grouped in the middle with labels for where to learn more about that insect. Durable cover, easy size to hold. But not the easiest to navigate and the pictures are outdated and not as detailed as more modern books or even as much as the old drawing only field guides.",
      "rating": 4.0,
      "verified": true,
      "author": "Hanush Sisters",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "We told her to be careful with the very thin pages as they would tear easily if she wasn't aware and so far she has ...",
      "text": "My daughter LOVES this book, she is 7 and loves bugs and looks through it every time we see a new kind of bug, also just to see all the different kind of bugs in it. We told her to be careful with the very thin pages as they would tear easily if she wasn't aware and so far she has done beautifully (it's been about 2 months). The picture pages are thicker and are wonderful, this is very worth the money and perfect for little curious brains.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Morningstar",
      "helpful_votes": 0,
      "publication_date": 20150813
    },
    {
      "title": "Easly and quickly look things up",
      "text": "I am no super enthusiast. I do however have a 11 year old that loves to bring me bugs. He would constantly ask, what kind of spider is this? Or bring me some obscure bug from the garden. So I decided to order this guide to be able to identify and learn a thing or two about whatever the flavor of the day turned out to be. It has enable me to not only easily and quickly identify his wares but also instill in him how to find information out for himself.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosemarie S.",
      "helpful_votes": 0,
      "publication_date": 20160102
    },
    {
      "title": "Good book, solid reference material",
      "text": "Good reference book. I come across spiders and beetles at my house that are not familiar. Nice to have a single source to look. I am old school and enjoy the book method over internet searching. Worth the money...",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin S",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Easy to use, excellent quality.",
      "text": "This is a fascinating and helpful book! The kids like to just look through the pages at all the different bugs even when they aren't searching for anything in particular. Set up well and easy to use. Lots of beautiful pictures! Our favorite find guide series!",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth E. Visser",
      "helpful_votes": 0,
      "publication_date": 20170606
    },
    {
      "title": "It's a gorgeous book!",
      "text": "This book makes my heart happy. The pictures are stunning. I've learned some things too. It arrived faster than I thought. These crazy times!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Excellent insect guide",
      "text": "The pictures and descriptions in this book make it a top-rate guide for looking up the various array of insects and spiders.",
      "rating": 5.0,
      "verified": true,
      "author": "Teri Chism",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Great book for identifying",
      "text": "We bought this for ourselves- adults. Our children enjoyed \" finding \" things to look up in the book so much, they are keeping the book!",
      "rating": 5.0,
      "verified": true,
      "author": "J.",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Great Resource Book",
      "text": "This books are all just great, and may make you think twice about stomping on a spider in your kitchen. Richly illustrated.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Salniker",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "You can always count on the National Audobon Society",
      "text": "This is a great book. I have the NAS bird field guide and the Mammells field guide as well. My only complaint is that I wish that they would put photos of both the male and female on each of the species. There is such a difference in looks,, and it is very hard to identify a particular species sometimes without seeing both. I have had to go online with my sons several times allready to find out what type of spider we had found in our garage. It was a female Hobo Spider,, which defers from the male quite substantially. Same thing with the bird book. Other than that,, bravo ! Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Trail Seeker",
      "helpful_votes": 0,
      "publication_date": 20091109
    },
    {
      "title": "Old Time Favorite",
      "text": "One of the old time favorites. I bought this ad a gift for my son-in-law, he is thrilled with it!",
      "rating": 5.0,
      "verified": true,
      "author": "sabea125",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Chock full of useless information while lacking useful information.",
      "text": "There are better field guides out there. This seems to be written by entomologists for entomologists and lacks information like the toxicity of bites and features that make insects and spiders interesting (at least to me).",
      "rating": 2.0,
      "verified": true,
      "author": "Bill Welte",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Good but not quite great",
      "text": "Really great photos and descriptions of common bugs. It's already helped me identify a couple bugs. Of course, with the millions of different bugs there are in the world, it doesn't have everything. (A book with every bug would be too huge to carry around!) What they should probably try is a regional insect and spider book like they have with the birds - only five or six regions instead of two.",
      "rating": 4.0,
      "verified": true,
      "author": "Hermit Writer",
      "helpful_votes": 2,
      "publication_date": 20140516
    },
    {
      "title": "Love these books!",
      "text": "Any of the Audubon books are worth owning. They are an amazing reference and teaching tool.",
      "rating": 5.0,
      "verified": true,
      "author": "priscilla",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "easy to use",
      "text": "so much information, easy to use, over-all excellent source of information. i continue to use National Audobon books as my #1 fact-based sources when i need great photos and believable facts for myself and my landscape customers.",
      "rating": 5.0,
      "verified": true,
      "author": "JDR",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Insects and Spiders",
      "text": "I enjoy the National Audubon Society collection . This particular book gave me all kinds of information I needed. The photos are exceptional and the descriptive writing is also easily understood. I will have a greater knowledge of the different species of insects and spiders and continue to use as a reference to any further questions I may have. I also will enjoy sharing this book with my family and friends in the future.",
      "rating": 4.0,
      "verified": true,
      "author": "Elizabeth Mersereau",
      "helpful_votes": 0,
      "publication_date": 20130730
    },
    {
      "title": "This is a GREAT BOOK for my daughter",
      "text": "My daughter spends much time on the computer looking up information on various things. She saw this book at the library and actually checked it out. When she knew it had to be returned, she asked if I could buy it for her. She continues to enjoy seeing strange bugs and then finding out their names and how they live, etc. The money I spent is SO worth the joy she has gained from owning this book!",
      "rating": 5.0,
      "verified": true,
      "author": "Anita L. Fretwell",
      "helpful_votes": 0,
      "publication_date": 20130908
    },
    {
      "title": "5 Stars",
      "text": "AS usual the National Audubon Society comes through with another great field guide... I have 7 or 8 now and I love them. They are a little larger than some of the \"pocket\" guides, but they contain more information. I usually don't carry them in the field anyway because I would end up carrying 2 or 3 at a time if I did. I just take pictures and reference to the guide when I get back home. You won't be disappointed, and if you already own a National Audubon Society Field Guide you probably already know what I mean.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Gates",
      "helpful_votes": 0,
      "publication_date": 20120905
    },
    {
      "title": "Great t-shirts",
      "text": "These shirts are nice and light weight. They are true to fit and wear sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Doc H.",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Outstanding guide for macro photographers",
      "text": "Getting into macro photography, I was discovering all kinds of weird insects, and had no idea what they were. I knew that to be as professional as possible, I needed to be able to identify my tiny subjects as well as know their habits, preferred envirnonment and so on... I like the way this book is organized. You have a table of contents of sorts that lists bug shapes. They are organized by similiar shape, and color. Not ment to be read from cover to cover, this book is excellent for throwing into my camera bag for to be a field reference.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Dukes",
      "helpful_votes": 9,
      "publication_date": 20040314
    },
    {
      "title": "A timely addition to my book hoarding problem 😂",
      "text": "Came as described. I’m a happy customer. Not much more to say, but yay more books!",
      "rating": 5.0,
      "verified": true,
      "author": "TX1137",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Butterfiles? Moths?",
      "text": "The section on butterflies and moths is woefully deficient. Don't bother with this if that is your interest in the book. It's too bad because the Audubon books we have about trees, birds, and reptiles are very good. Not this one.",
      "rating": 2.0,
      "verified": true,
      "author": "JH",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "Great Bug Book",
      "text": "This continues to be the best bug out in the market!",
      "rating": 5.0,
      "verified": true,
      "author": "Vojtech",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "All Things Creepy and Crawly",
      "text": "When my nephew was chosen for his school's science olympiad team as the \"bug\" expert, I knew he would need this book even though it was not one of the teacher's recommendations. I have the NASFG for birds, and I know they are like no other. Each features full color PHOTOGRAPHS of the subjects - not illustrations or renderings, and the details on habitat, migration, feeding, mating, etc.... are fabulous. It is well worth the few extra dollars! If you like/love/hate bugs, this is your one mandatory reference guide!",
      "rating": 5.0,
      "verified": true,
      "author": "Gail Hicks",
      "helpful_votes": 4,
      "publication_date": 20060216
    },
    {
      "title": "Great!",
      "text": "Excellent condition. It made a perfect Birthday gift for my friend!",
      "rating": 5.0,
      "verified": true,
      "author": "NM",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Awesome bug book",
      "text": "My son loves bugs. At 7, he is learning to read better every day and he loves this book. There are plenty of awesome pictures of different bugs and also plenty of facts to learn about them. This will be in our bag during every camping and hiking trip!!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Yates",
      "helpful_votes": 0,
      "publication_date": 20161018
    },
    {
      "title": "Excellent, convenient shape, solid cover",
      "text": "what can be said negative about this work of excellence...the cover is flexable, makes it more portable than more square soft cover guides.",
      "rating": 5.0,
      "verified": true,
      "author": "JC Anin",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "This book would be better for general reference",
      "text": "For insects, this is \"basic\" book. We have a hard time finding our garden critters in this book, as there are thousands of insects and one book is not enough. Will need to get another more \"in-depth\" book to complement this one. This book would be better for general reference, not to try to look for insects or spiders you saw on your last hike.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20141024
    },
    {
      "title": "Love these",
      "text": "Bought a few of these books as a gift for my husband. He loved them. I really like the colored leather covers, I actually have them up on display.",
      "rating": 5.0,
      "verified": true,
      "author": "Baylee S.",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Great gift for those that love bugs!",
      "text": "What a great guide! I purchased this for my husband. He and my son are always out exploring and finding all sorts of bugs so I figured they would both enjoy using this guide to figure out what all of the bugs are that they find and I was right they love this book!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160803
    },
    {
      "title": "gift for my grandson",
      "text": "My grandson LOVES this book. He refers to it and reads it a lot. He is only 11 years old but loves to learn and this book is perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Gradall880",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "A good basic guide",
      "text": "These audubon guides are good basic guides. We got them to identify butterflies, insects and spiders in our midwestern back yard. It is often difficult to find the bugs we are looking for. We've had much more luck with Kenn Kaufman's \"Field Guide to Insects of North America\". In some ways it's more user friendly, with lots of bugs photos on one page and descriptions that are on the opposing text page. The Audubon guide is set up so that you have to flip back and forth between images in one section and text/description in another - which can be tedious - however, the Audubon descriptions are much more thorough than Kaufman's.",
      "rating": 3.0,
      "verified": true,
      "author": "Melissa Moreton",
      "helpful_votes": 2,
      "publication_date": 20090616
    },
    {
      "title": "For beginners only",
      "text": "I found this book to be overly broad, which should not have surprised me, given the subject. If you are just starting to be interested in identifying the most likely critters you will encounter, I think this book will serve you well. It is an all purpose field guide. If you are seeking more detail, best buy something else. The format is the same as other Audubon field guides. The photos are generally clear and the information seems accurate. Like others in the series, it is well made, just not sufficently detailed for those needing to ID less common animals.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Nasser",
      "helpful_votes": 4,
      "publication_date": 20060504
    },
    {
      "title": "Awesome book!!!!",
      "text": "Our family loves these books. This is the third book for our collection. The picture qualities are amazing. The pages are thick and flexible. These books will last for a loooooooong time.",
      "rating": 5.0,
      "verified": true,
      "author": "Rockin_Red",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "Love it!",
      "text": "It great condition for its age. I bought for my son's 5th birthday (what boy doesn't love bugs?!) Cannot wait to see the look on his face come his birthday!",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret Reid",
      "helpful_votes": 0,
      "publication_date": 20170317
    },
    {
      "title": "Very helpful and useful.",
      "text": "Need to know what critter is crawling around in your housed or eating your garden plants,.....this is the book that will quickly identify them. Not overly scientific with details that most of us would not even understand and not too simple . Just enough info with lots of colorful pictures to aid in the identification of an insect or spider. Very helpful and useful.",
      "rating": 5.0,
      "verified": true,
      "author": "rev munch",
      "helpful_votes": 0,
      "publication_date": 20140805
    },
    {
      "title": "Great guide",
      "text": "This book is awesome. It's full of pictures and great descriptions of lots of spiders and animals.",
      "rating": 5.0,
      "verified": true,
      "author": "luke",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "The binding worries me, it makes awkward noises when ...",
      "text": "The binding worries me, it makes awkward noises when opening it. I don't think it will lose pages, but still makes me want to handle it with care. The black on the picture sections is smeary, so don't be surprised if you start leaving finger prints there.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Stillwell",
      "helpful_votes": 0,
      "publication_date": 20150111
    },
    {
      "title": "Fun",
      "text": "I use it to look things up. It's really good at showing me what the heck that strange bug is!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Panda",
      "helpful_votes": 0,
      "publication_date": 20170321
    },
    {
      "title": "Great reference book!",
      "text": "Being somewhat of a nerd, I've seen many insects and spiders in my back yard (or on business windows, or in the middle of the woods) whose classification eluded me. Many times, I'd take a digital picture of it and then search internet dichotomy trees for the exact bug I'd just seen. This field guide has made this process much less painful, and I haven't found a single insect or spider yet that hasn't been in the book. If you like bugs--or don't like them, and want to make sure a particularly frightening specimen isn't dangerous--this Field Guide is definitely worth the small investment.",
      "rating": 5.0,
      "verified": true,
      "author": "TheWanderingGazelle",
      "helpful_votes": 0,
      "publication_date": 20090107
    },
    {
      "title": "Great!",
      "text": "Doesn't have a whole bunch of details but it's perfect for identification of insects. Perfect if you are just starting to learn about insects. Contains extremely detailed pics and basic information of the Insect",
      "rating": 5.0,
      "verified": true,
      "author": "dawn",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Great reference book",
      "text": "Love this reference book for the macro images I take.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra L. Simmons",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Great book",
      "text": "Great book. informative and educational for a kid curious about bugs.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Fascinating!",
      "text": "Bought this for my 3-year old grand daughter who is fascinated by insects. She LOVES it and studies each page.",
      "rating": 5.0,
      "verified": true,
      "author": "T. L. Needham, Author",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "recommend",
      "text": "This is an outstanding book for insect lovers. Still in use after many years!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael S.",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "I highly recommend this (or any of the other Audubon Field Guides) ...",
      "text": "I've used these books since my kids were little... now buying new ones for the grandkids. You can't go wrong with this one or any of the other topics bound into this kind of an Audubon reference book. I highly recommend this (or any of the other Audubon Field Guides) as a great resource or a bunch of great pics and accurate facts!",
      "rating": 5.0,
      "verified": true,
      "author": "Teri L. Wood",
      "helpful_votes": 0,
      "publication_date": 20160608
    },
    {
      "title": "My Little Scientist loves it",
      "text": "My son, who is very much into biology and science, and an excellent reader, loved this book at age nine. Reading level is more aimed at an adult audience. Pictures are clear and interesting, well illustrating text.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20140416
    },
    {
      "title": "Rough condition but usable",
      "text": "Mine was in much rougher condition than I had envisioned by the term \"acceptable,\" but it will do for my intended purpose. Disappointed that this field guide doesn't describe bites and stings except in particularly venomous species. But for general ID's it will do its job.",
      "rating": 4.0,
      "verified": true,
      "author": "taylor",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Buy these great books for gifts too! Unique and instructive!",
      "text": "All t he Audubon books are the best for studying and identifying animals and insects and foliage etc., that God put upon our earth. I buy these books as gifts and the recipients love them. A very unique, useful gift...",
      "rating": 5.0,
      "verified": true,
      "author": "Dy",
      "helpful_votes": 0,
      "publication_date": 20141004
    },
    {
      "title": "Great books, recommend the whole series",
      "text": "All of the National Audubon books are wonderful and even a 4th or 5th grader can find information in them and understand what they are reading.",
      "rating": 5.0,
      "verified": true,
      "author": "Avid Reader",
      "helpful_votes": 0,
      "publication_date": 20170604
    },
    {
      "title": "I love all my Arizona insects",
      "text": "If you don't like insects and admire their lives and their importance to mankind, you're missing out on nature at its best",
      "rating": 5.0,
      "verified": true,
      "author": "NightHeron",
      "helpful_votes": 0,
      "publication_date": 20170318
    },
    {
      "title": "Detailed!",
      "text": "Bought this as a Christmas gift for my husband who is a Pest Control Technician. He absolutely loves it. And it's a great size to keep in his work truck!",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie Shipley",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "I own almost all the Audubon field guides and love them. This title though",
      "text": "I own almost all the Audubon field guides and love them. This title though, is seriously short on different species. I understand that the sheer number of \"bugs\" makes including them all in one volume is impossible, but the selection provided is lacking too many.",
      "rating": 2.0,
      "verified": true,
      "author": "Spue",
      "helpful_votes": 0,
      "publication_date": 20160606
    },
    {
      "title": "I love this these books from Audubon",
      "text": "I love this these books from Audubon, the format is great. This guide on the insects is a little sparse, but that's just because there are so many insects. It's still interesting.",
      "rating": 5.0,
      "verified": true,
      "author": "Boatman30",
      "helpful_votes": 0,
      "publication_date": 20160103
    },
    {
      "title": "Great color photographs but underinclusive",
      "text": "The color photographs are vivid and in focus. The descriptive text is interesting and useful. However, this book ought to have been called our 25 favorite spiders and 75 favorite insects. I haven't been able to find a single local spider in the book (and we have many to choose from). It's really less of a field guide and more of a coffee table book.",
      "rating": 4.0,
      "verified": true,
      "author": "T.K. Perry",
      "helpful_votes": 23,
      "publication_date": 20010619
    },
    {
      "title": "Excellent!",
      "text": "Contains exactly the answers I was looking for. Very well written and easy to use format!",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "Get it",
      "text": "Highly recommend to anyone wanting bug knowledge. Covers so much, just buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "Logan MayTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "Excellent Field Guide!",
      "text": "These books are great to have, and hard to find. I ordered this as a gift for my mom, who loves this particular brand of field guide book to complete her collection. They last forever, very informative and great to have if you are a nature lover!",
      "rating": 5.0,
      "verified": true,
      "author": "LIQUIDSILVER",
      "helpful_votes": 0,
      "publication_date": 20121124
    },
    {
      "title": "A great guidebook!  highly recommend it.",
      "text": "A friend had this guide and i ordered it immediately! it's a great, colorful and most informative field guide. Very useful for me and my family who live in the Catskills where we live.",
      "rating": 5.0,
      "verified": true,
      "author": "jo cicale",
      "helpful_votes": 0,
      "publication_date": 20150810
    },
    {
      "title": "Unless you already know what you're looking for, it's not all that helpful for ID's",
      "text": "I bought this small but thick book to try to identify our local arthropods, but unless you already know what you're looking for, it's not all that helpful.",
      "rating": 3.0,
      "verified": true,
      "author": "AJP",
      "helpful_votes": 0,
      "publication_date": 20160727
    },
    {
      "title": "Great reference guide",
      "text": "I love these field guides. They are compact, full of information, contain high quality photos of each entry to make identification unmistakable, and contain every insect I have ever needed to look up. These may be the best field guide out there.",
      "rating": 5.0,
      "verified": true,
      "author": "BerryPatch01",
      "helpful_votes": 0,
      "publication_date": 20130823
    },
    {
      "title": "I highly recommend giting this book.",
      "text": "I got this book for my entomology Project, And was a great book.",
      "rating": 5.0,
      "verified": true,
      "author": "WHN P.",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "The internet is a better option these days for identifying insects and even using ...",
      "text": "too many insects to fit in books. The internet is a better option these days for identifying insects and even using the web is like spitting in wind.",
      "rating": 3.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20150720
    },
    {
      "title": "Excellent guide, with easy to use color guide",
      "text": "Excellent guide, with easy to use color guide. For this to really be effective for me though, I'd need one that was region-specific.",
      "rating": 3.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20170626
    },
    {
      "title": "great insect book",
      "text": "I am a professional exterminator and this is the best carry in the vehicle book I have found as a reference. A lot of pictures and descriptions of a large variety of indoor and outdoor pests.",
      "rating": 5.0,
      "verified": true,
      "author": "Spelfire",
      "helpful_votes": 0,
      "publication_date": 20130810
    },
    {
      "title": "On par with all the Audobon Guides",
      "text": "Very informative like all the Audobon Guides, and lots of photos, which really helps. Only caveat is that I'd like to see them have several volumes to cover ALL insects in North America, as there are too many to cover in just this one guide. Although I am aware that they have separate guides for butterflies.",
      "rating": 5.0,
      "verified": true,
      "author": "Gardenbroad",
      "helpful_votes": 2,
      "publication_date": 20070830
    },
    {
      "title": "National Audubon Society's reference books are the Best in any category.",
      "text": "Any reference books from the National Audubon Society are always TOP Notch!",
      "rating": 5.0,
      "verified": true,
      "author": "TexasNative",
      "helpful_votes": 0,
      "publication_date": 20170313
    },
    {
      "title": "great for identifying bugs around the home",
      "text": "Lots of bugs, great for identifying bugs around the home.",
      "rating": 5.0,
      "verified": true,
      "author": "EJPSview",
      "helpful_votes": 0,
      "publication_date": 20170309
    },
    {
      "title": "Got a creepy thing? Find it's name",
      "text": "This is a great book (as are all Audubon guide books) the photos are excellent for identifying those little creepy crawlers you encounter both inside and outside your house, it even tells you what they eat in case you want to make pets out of them !!",
      "rating": 4.0,
      "verified": true,
      "author": "Bob M",
      "helpful_votes": 0,
      "publication_date": 20111129
    },
    {
      "title": "Good book for looking up BUGS!!",
      "text": "We have several \"field guide\" books i.e. books about trees. animal tracks,etc. This book helped us to learn about the insects, caterpillars, etc. we were seeing in our environment. The photos are full color, the descriptions are concise and easy to read. We like this book and we're glad we bought it.",
      "rating": 4.0,
      "verified": true,
      "author": "Shirley D.",
      "helpful_votes": 2,
      "publication_date": 20061103
    },
    {
      "title": "I Love This Book",
      "text": "I refer to it at least a couple of times a week & recommend it to any other amateur. Bought this copy for my nephew, who also loves it. The illustrations & information may not impress an expert, but I find it well-organized & easy to use. I've never seen an insect that I couldn't identify by using it (tho' I live in LA, not exactly the insect capital of the world). Also-the photos are gorgeous!",
      "rating": 5.0,
      "verified": true,
      "author": "An nA",
      "helpful_votes": 0,
      "publication_date": 20080307
    },
    {
      "title": "Guide to N America Insects and Spiders",
      "text": "This book ID's a lot of insects and spiders, although is was first written in 1980. But there are many not mentioned in this book. Great for beginners. I shall look for a more recent published book.",
      "rating": 3.0,
      "verified": true,
      "author": "Morris L Turner",
      "helpful_votes": 0,
      "publication_date": 20130404
    },
    {
      "title": "field guide",
      "text": "I love these books. I have found plenty on critters that this book doesn't have, but I generally find with field guides, you need more than one. It is very handy, though, when in the field. Small and lightweight so it doesn't get in the way. Good to have around.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Macklin",
      "helpful_votes": 0,
      "publication_date": 20090802
    },
    {
      "title": "Cool",
      "text": "Very informative and helpful. Doesn't have a very wide or in-depth catalogue of spiders though which is sort of inconvenient.",
      "rating": 4.0,
      "verified": true,
      "author": "Meg",
      "helpful_votes": 0,
      "publication_date": 20160219
    },
    {
      "title": "Descriptions are great, photos are awesome!!",
      "text": "The photos are awesome, truly great text descriptions of the creatures. Thank you for this great book!!",
      "rating": 5.0,
      "verified": true,
      "author": "ROGER WIMPFHEIMER",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "A Must-Have",
      "text": "National Audubon Society field guides are the best I've come across--it's the photos. Others may have more detailed information, but nobody has beaten their photos.",
      "rating": 5.0,
      "verified": true,
      "author": "JAM Ovid, MI",
      "helpful_votes": 0,
      "publication_date": 20150123
    },
    {
      "title": "Great Resource",
      "text": "We just built a house that is more outside of the city than our previous house. Seeing all kinds of new bugs and spiders. This will be a great resource to learn what they are and whether we should let them live!",
      "rating": 5.0,
      "verified": true,
      "author": "CH",
      "helpful_votes": 0,
      "publication_date": 20130726
    },
    {
      "title": "super for determining whats invading the yard",
      "text": "I loved this book so much I bought one for my Nursery School. The kids love looking up what the bugs are. I own the whole set at home and refer to them often. Clear and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "TeaLadyTeresa",
      "helpful_votes": 0,
      "publication_date": 20130710
    },
    {
      "title": "Great!",
      "text": "This is a great book, so glad to have it!",
      "rating": 5.0,
      "verified": true,
      "author": "A.",
      "helpful_votes": 0,
      "publication_date": 20160519
    },
    {
      "title": "This is one of the best books for identifying insects and spiders",
      "text": "This is one of the best books for identifying insects and spiders. Full color pictures and clear descriptions are included. Let's you know what area most can be found too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "Wonderful",
      "text": "Had the information I was looking for. Love the photos.",
      "rating": 5.0,
      "verified": true,
      "author": "Justashoppin",
      "helpful_votes": 0,
      "publication_date": 20161231
    },
    {
      "title": "Great for bug haters!",
      "text": "My wife is deathly afraid of spiders - they're all deadly! So, what better gift for somebody afraid of spiders than a book on spiders. Now any bug can be identified as deadly or benign!",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Franks",
      "helpful_votes": 0,
      "publication_date": 20121128
    },
    {
      "title": "Beautiful Illustrations",
      "text": "This is a great field guide for North American insects and spiders. The illustrations are wonderful- I especially like that it shows a picture of the insects' adult and larval stage. Great book to take on camping trips and hikes.",
      "rating": 5.0,
      "verified": true,
      "author": "MWade",
      "helpful_votes": 0,
      "publication_date": 20130508
    },
    {
      "title": "Nice Book,",
      "text": "The photos in this book are so vivid that they give me the willies, but that's why we bought it to id the good from the bad insects. has a good feel, nice size good descriptions.",
      "rating": 5.0,
      "verified": true,
      "author": "Clarice",
      "helpful_votes": 0,
      "publication_date": 20121210
    },
    {
      "title": "A gift",
      "text": "Purchased for a resource for my classroom. Excellent photos and information! Good value! Adults and children interested in insects would find this book an excellent guide.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheryl S.",
      "helpful_votes": 0,
      "publication_date": 20130414
    },
    {
      "title": "Book review: National Audobon Society Field guide to insects",
      "text": "The book was recieved in a timely manner in excellent condition. It is a very informative guide to Insects and spiders normallya seen in North America, goes well with the rest of the volumes I have which includes NA Mammals and birds, thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "bassman",
      "helpful_votes": 0,
      "publication_date": 20100908
    },
    {
      "title": "Audubon Field Guide",
      "text": "Superior product. The photos are well done and accurate. Ideal for field use or just around the house, garden, or yard. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "W. P. DeGraw",
      "helpful_votes": 0,
      "publication_date": 20130611
    },
    {
      "title": "Damaged?",
      "text": "Multiple pages were ripped out. There was a entire chapter missing",
      "rating": 1.0,
      "verified": true,
      "author": "Naomi Yokoi",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Good book, poor quality control",
      "text": "Great book, but it came with a bunch of pages bent and folded.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Five Stars",
      "text": "Great book just like all the other National Audubon Society books. Beautiful pictures!",
      "rating": 5.0,
      "verified": true,
      "author": "webb",
      "helpful_votes": 0,
      "publication_date": 20141216
    },
    {
      "title": "Typical Audubon book",
      "text": "A typical Audubon book, you either love them or don't. I don't find this one as easy to use as some of the others. It's ok but there are better books out there.",
      "rating": 4.0,
      "verified": true,
      "author": "Carol Mills",
      "helpful_votes": 0,
      "publication_date": 20130407
    },
    {
      "title": "Audubon for the family",
      "text": "Exceptional in all ways! I have used the whole set for years for the grand kids at reunions and traveling in our motor home. The first thing they do as they say Hi, is head for the drawer and pull out the ones they want, Then ask permission sign the checkout. Dash out the door fascinated for hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20141213
    },
    {
      "title": "Great Insect Guide Book",
      "text": "We really like the layout and the usefulness of it. Audubon does a great job with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean D. Clarkin",
      "helpful_votes": 0,
      "publication_date": 20150818
    },
    {
      "title": "Bought this as a gift",
      "text": "One of my grandsons is nuts about bugs so this was the perfect gift. And he has 3 brothers to share it with.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne C. Carper",
      "helpful_votes": 0,
      "publication_date": 20130302
    },
    {
      "title": "Great ID book for bugs",
      "text": "Great book for identification of insects and spiders if that's your goal. I was able to ID two strange and totally never-seen-before insects. Provides great pics and information.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160129
    },
    {
      "title": "Nice!",
      "text": "Great books for looking up stuff, we have a whole collection of these National Audubon Society books to reference! A +",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130114
    },
    {
      "title": "great reference",
      "text": "This book easy to read, understand and follow. This is a great reference book with good photos to help in identification.",
      "rating": 5.0,
      "verified": true,
      "author": "swohiom",
      "helpful_votes": 0,
      "publication_date": 20130219
    },
    {
      "title": "... have a set of the Audubon books and really enjoy them. I decided to start my granddaughters with ...",
      "text": "I have a set of the Audubon books and really enjoy them. I decided to start my granddaughters with their own set.",
      "rating": 5.0,
      "verified": true,
      "author": "Dixie Lee Williams",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "instead of it's actual range restricted to parts of the central and south great plains. I was really disgusted that Audubon rele",
      "text": "The spider section was clearly not edited by an experienced arachnologist, because the page on brown recluses is made purely of the typical myths and hypes. They claim the spider is found throughout the U.S. instead of it's actual range restricted to parts of the central and south great plains. I was really disgusted that Audubon released this.",
      "rating": 1.0,
      "verified": true,
      "author": "Corey",
      "helpful_votes": 4,
      "publication_date": 20161003
    },
    {
      "title": "Love nature, love these books.",
      "text": "If you have any interest in nature, nothing beats these Audubon reference books!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul A. Dietrich",
      "helpful_votes": 0,
      "publication_date": 20150627
    },
    {
      "title": "Five Stars",
      "text": "Quick shipping and great price! Will add more comments to this review after I've used it.",
      "rating": 5.0,
      "verified": true,
      "author": "mmadonna40",
      "helpful_votes": 0,
      "publication_date": 20141129
    },
    {
      "title": "Excellent",
      "text": "Book received in timely manner as advertised, good as new and just as I expected it to be. Would happily do business with them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20110923
    },
    {
      "title": "Great",
      "text": "I would highly recommend this book for anyone, especially students who will be involved in a bug/insect collection. This saves many trips to the library or many searches on the internet to identify insects.",
      "rating": 5.0,
      "verified": true,
      "author": "JCS",
      "helpful_votes": 0,
      "publication_date": 20130706
    },
    {
      "title": "I was surprised the Audubon had their work printed in China",
      "text": "Some of the pages weren't cut and stuck inward in an awkward way",
      "rating": 4.0,
      "verified": true,
      "author": "Jiri Hoogland",
      "helpful_votes": 0,
      "publication_date": 20150207
    },
    {
      "title": "Insect book",
      "text": "This book proved its worth immediately. I saw a bug that I wasn't familiar with and with the help of the book I was able to identify it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20130101
    },
    {
      "title": "Five Stars",
      "text": "We have so many insects and spiders in Florida - this book is a MUST!",
      "rating": 5.0,
      "verified": true,
      "author": "Wynell Thames-King",
      "helpful_votes": 0,
      "publication_date": 20140728
    },
    {
      "title": "Perfect.",
      "text": "Just right for what we use it for: Finding bugs in the yard or the garage, and identifying, \"What IS that thing?\"",
      "rating": 5.0,
      "verified": true,
      "author": "T. Fricke",
      "helpful_votes": 0,
      "publication_date": 20130103
    },
    {
      "title": "but very good illustrations.",
      "text": "Too ambitious for the book's format, but very good illustrations.",
      "rating": 3.0,
      "verified": true,
      "author": "Matthew Kettle",
      "helpful_votes": 0,
      "publication_date": 20140724
    },
    {
      "title": "Another winner!!",
      "text": "After looking at the National Audubon Society Field Guide to North American Trees: Eastern Region and loving it I knew this would be a winnner as well.I bought this for a friend's 2 sons who are really into insects and they are having an absolute ball with it. Thier parents are delighted that the boys have a \"book\" that they are enjoying reading and using. They take it everywhere with them and have started collecting and identifying thier catches,diagraming them and where they were found..good clean outdoors activity as been created by this one book; I am so pleased!!",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret O. Nelson",
      "helpful_votes": 2,
      "publication_date": 20051014
    },
    {
      "title": "Needs More Pictures",
      "text": "Has a lot of really good info but if you're going to be using it to identify pests you might hit some snags if you find something more unusual. It needs more pictures to be a more beneficial identification guide.",
      "rating": 4.0,
      "verified": true,
      "author": "Carrara Onody",
      "helpful_votes": 0,
      "publication_date": 20140418
    },
    {
      "title": "Four Stars",
      "text": "Beautifully illustrated and maintaining the quality of the National Audubon Society Series.",
      "rating": 4.0,
      "verified": true,
      "author": "M T CREECH",
      "helpful_votes": 0,
      "publication_date": 20150101
    },
    {
      "title": "Easy way to identify",
      "text": "This book has proved usedful for identifying my bug friends that stumble into our enclosed porch. My kids also enjoy the bugs- great pictures",
      "rating": 4.0,
      "verified": true,
      "author": "ladyofflame6",
      "helpful_votes": 0,
      "publication_date": 20130708
    },
    {
      "title": "Review of this book .",
      "text": "It is very easy to look up information on insects & spiders . The book contains beautiful & informative photos . I recommend it for anyone with an interest in these topics .",
      "rating": 5.0,
      "verified": true,
      "author": "Arlene S. Zivitz",
      "helpful_votes": 0,
      "publication_date": 20130730
    },
    {
      "title": "As always, National Audubon Society Field Guides are THE ...",
      "text": "As always, National Audubon Society Field Guides are THE go-to guide books to have in your collection for students.",
      "rating": 5.0,
      "verified": true,
      "author": "MaineEDU",
      "helpful_votes": 0,
      "publication_date": 20150307
    },
    {
      "title": "Five Stars",
      "text": "Excellent photos and detailed descriptions. Would highly recommend this book for any nature lover.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20150120
    },
    {
      "title": "Good quality guide and colorful images",
      "text": "Good quality, very comprehensive book with great color pictures. It could benefit from telling you if the creatires pose any threat to humans or are poisonous, as that's why I bought it!",
      "rating": 4.0,
      "verified": true,
      "author": "nicdc",
      "helpful_votes": 0,
      "publication_date": 20070514
    },
    {
      "title": "Lovely appreciated gift",
      "text": "Our 6 yr. old grandson wanted this book for his birthday. He loves it, almost daily bringing bugs to be identified. With he help of his parents he's becoming quite knowledgable on this subject!",
      "rating": 5.0,
      "verified": true,
      "author": "Lois Minnich",
      "helpful_votes": 0,
      "publication_date": 20130627
    },
    {
      "title": "National Audobon Society Field Guide to North American Insects and Spiders",
      "text": "Nice compact book, great pictures to easily identify insects,would recommend to anyone looking to identify any insect a person would come into contact with on an everyday basis.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20080921
    },
    {
      "title": "Very good book nice detail information on insects",
      "text": "Very good book nice detail information on insects. I use this book for pest control comes in real handy on identifying the insects .",
      "rating": 5.0,
      "verified": true,
      "author": "Larry Rico",
      "helpful_votes": 0,
      "publication_date": 20160705
    },
    {
      "title": "Kids love this book",
      "text": "This guide has excellent photos of the insects and spiders, plus information helpful in knowing range, food, and life cycle. My elementary science students love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Constance Austin",
      "helpful_votes": 0,
      "publication_date": 20140607
    },
    {
      "title": "What you would expect",
      "text": "I needed this book for my science olympiad team. It is exactly what you would expect from the Audubon society. Great colors, good quality, great examples. I ordered many other field guides at the suggestion from other teachers.",
      "rating": 5.0,
      "verified": true,
      "author": "KB",
      "helpful_votes": 3,
      "publication_date": 20060225
    },
    {
      "title": "insects",
      "text": "All of the audubon field manuals are excell. it have used many time to identify trees on my land. it is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald Price",
      "helpful_votes": 0,
      "publication_date": 20130621
    },
    {
      "title": "Excellent Guide.",
      "text": "This is a very easy to follow guide. The photos are excellent and the information thorough. Very Happy with this.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia P.",
      "helpful_votes": 0,
      "publication_date": 20150724
    },
    {
      "title": "National Audubon Society Field Guide to North American Insects and Spiders",
      "text": "This is an excellent guide to identify insects. My daughter usually collects insects and puts a collection together each summer, and this has been very helpful to help her identify nearly all of her insect specimens.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley Beaty",
      "helpful_votes": 0,
      "publication_date": 20061104
    },
    {
      "title": "A person is never too young to start appreciating the world around them",
      "text": "A comprehensive guide with LOTS of photos. Well organized information. Easy to clean cover. Good construction. I bought this book as a Christmas present for my 6 year old grandson when I saw him mesmerized with my copy of this book. He even made some sketches from it.",
      "rating": 5.0,
      "verified": true,
      "author": "Darlene",
      "helpful_votes": 0,
      "publication_date": 20131217
    },
    {
      "title": "A Must Have",
      "text": "Somehow my copy turned up missing. A home library is not complete without a full set of the National Audubon Society. Gardening, hiking and camping are more enjoyable and in some cases safer when you have these books to rely on.",
      "rating": 4.0,
      "verified": true,
      "author": "Sherman",
      "helpful_votes": 0,
      "publication_date": 20140106
    },
    {
      "title": "5 stars",
      "text": "It came in better quality than stated and was exactly what I asked for. I definitely recommend them! Thanks so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn Bellotti",
      "helpful_votes": 0,
      "publication_date": 20130109
    },
    {
      "title": "Insect & spider book.",
      "text": "My daughter moved to a new area and she is seeing many different inscets. She wanted to find out what kind & the names of them. She is looking forward to using the book.",
      "rating": 5.0,
      "verified": true,
      "author": "holister",
      "helpful_votes": 0,
      "publication_date": 20140103
    },
    {
      "title": "Five Stars",
      "text": "This is the real deal. All them other bug books faking it dawg.",
      "rating": 5.0,
      "verified": true,
      "author": "K. F. Sockbeson Jr.",
      "helpful_votes": 0,
      "publication_date": 20140802
    },
    {
      "title": "National Audubon Society Field Guide",
      "text": "This was a gift for a very intelligent girl at Christmas. She was very happy with all the information to be read about and the pictures were outstanding.",
      "rating": 4.0,
      "verified": true,
      "author": "Janet",
      "helpful_votes": 0,
      "publication_date": 20140128
    },
    {
      "title": "National Audubon Society Field Guide to North American Insects and Spiders (National Audubon Society Field Guides)",
      "text": "National Audubon Society Field Guide to North American Insects and Spiders (National Audubon Society Field Guides) Great book thank you very much!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie anaya",
      "helpful_votes": 0,
      "publication_date": 20090513
    },
    {
      "title": "Great for the bug persone.",
      "text": "This was purchased for my nephew for Christmas, He was always ask to borrow my husbands copy, so very time he would go for it, it was not here.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20131128
    },
    {
      "title": "NAS always has good books",
      "text": "In their tradition the National Audubon Society has produced a fine reference work. It is a good addition to the library",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Anderson",
      "helpful_votes": 0,
      "publication_date": 20140218
    },
    {
      "title": "Perfect educational tool",
      "text": "I have fought every autobahn book for my grandchildren , they loved them, carry them everywhere. well-made, great pictures , wonderful book.",
      "rating": 5.0,
      "verified": true,
      "author": "Kip",
      "helpful_votes": 0,
      "publication_date": 20131117
    },
    {
      "title": "Exactly what I needed!",
      "text": "Shipped quick and easy. Can't go wrong with the NAS Field Guides they provide a great reference that are easy to read. (very thorough in description)",
      "rating": 5.0,
      "verified": true,
      "author": "Nichol O.",
      "helpful_votes": 0,
      "publication_date": 20140125
    },
    {
      "title": "'what's that bug?'",
      "text": "Another in the Audobon Field Guides series. Very useful guide, great pictures and text. Includes spiders, caterpillars, butterflies, moths, and lots of interesting critters.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Iak",
      "helpful_votes": 0,
      "publication_date": 20090426
    },
    {
      "title": "really nice book",
      "text": "I ordered this book for my wife as she is interested in insects in the garden and she has found this to be a very helpful book",
      "rating": 5.0,
      "verified": true,
      "author": "Reallyrusty",
      "helpful_votes": 0,
      "publication_date": 20131002
    },
    {
      "title": "Bug Book",
      "text": "I basically was looking for spider book, but this was a spider book and so much more. Very helpful identifying insects. I'm very pleased with it.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Millan",
      "helpful_votes": 0,
      "publication_date": 20050930
    },
    {
      "title": "GOOD!",
      "text": "Thanks to this book, I got medal in my Science Olympiad competition. It is the most helpful book out there for entomology event!",
      "rating": 5.0,
      "verified": true,
      "author": "Phu Nguyen",
      "helpful_votes": 0,
      "publication_date": 20131227
    },
    {
      "title": "I like the detailed information with great pictures",
      "text": "This is the third Audubon book, I like the detailed information with great pictures. Wish there were more pics.",
      "rating": 5.0,
      "verified": true,
      "author": "Mickey",
      "helpful_votes": 0,
      "publication_date": 20151206
    },
    {
      "title": "Disappointing for a Canadian",
      "text": "I've recently taken up macro photography & wanted to be able to find info about the insects that I'm shooting around the Montreal area. Perhaps this guide might be good for someone in the US, but it's certainly lacking a LOT for us Canadians. Out of the 10 insects that I've searched for so far~ I've found one.",
      "rating": 1.0,
      "verified": true,
      "author": "starseedz",
      "helpful_votes": 7,
      "publication_date": 20120423
    },
    {
      "title": "Defective book",
      "text": "Do Not Buy. I bought as new but received a printing defect copy. There were multiple pages that were misaligned. Some that stuck out from the book were either cut off or folded over. Information on those pages were missing. I'm am starting to think that what is sold on this website is stuff they cannot sell in stores due to it being a defect, cheap Chinese junk, or does not sell. Buy in the store so you can see the copy before you get it.",
      "rating": 1.0,
      "verified": true,
      "author": "bill",
      "helpful_votes": 2,
      "publication_date": 20150519
    },
    {
      "title": "Great",
      "text": "I love this series of books I have eastern trees and eastern wildflowers and mushrooms and eastern birds all from this series and this one was a great addition to the collection.Great buy worth every penny and nice quality.",
      "rating": 5.0,
      "verified": true,
      "author": "T&M",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "... are older (somewhat out of date) these guides are great to me",
      "text": "I have all of these series of field guides and even though they are older (somewhat out of date) these guides are great to me.",
      "rating": 5.0,
      "verified": true,
      "author": "Axiom Appellant",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Great entomolgy guide",
      "text": "Perhaps the most complete and graphic insects identification guide. Perfect for all ages. My 8 year old son just devoured it.",
      "rating": 5.0,
      "verified": true,
      "author": "JC4EVER",
      "helpful_votes": 0,
      "publication_date": 20140409
    }
  ],
  "product_meta": {
    "title": "National Audubon Society Field Guide to Insects and Spiders: North America (National Audubon Society Field Guides)",
    "rating": 4.7,
    "specifications": {
      "Item Weight": "1.29 pounds",
      "Leather Bound": "992 pages",
      "ISBN-13": "978-0394507637",
      "Product Dimensions": "4.1 x 1.4 x 7.7 inches",
      "ISBN-10": "9780394507637",
      "Publisher": "Knopf; 1st Edition (November 12, 1980)",
      "Language:": "English",
      "ASIN": "0394507630",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Biological Sciences",
      "Books",
      "Science & Math"
    ],
    "price": ""
  }
}